[
  {
    "ID": "CHAR-001",
    "Type": "PC",
    "Name": "Arc en Ciel",
    "Content": "A changeling rogue introduced in Session #1 at Thunder’s Respite. Known for her disguises, irreverent humor, and fascination with cooking. Her ghostly past with Rory and connection to the Ghost King define her darker arc. She views the party as her chosen family and is often the first to improvise or act morally gray.",
    "Related": ["CHAR-002", "CHAR-003", "CHAR-004", "CHAR-005", "CHAR-006", "CHAR-021", "LOC-001", "LOC-008", "EVENT-009", "QUEST-003"]
  },
  {
    "ID": "CHAR-002",
    "Type": "PC",
    "Name": "Vyphira (Vy)",
    "Content": "Dragonborn artificer introduced in Session #1. A master armorsmith with deep personal ties to her homeland Tempest’s Watch and rival craftsmen such as Voraxik Valarnn. Her story arc focuses on reclaiming stolen family heirlooms and unraveling the mystery of the sigils on her tools. Displays pride, loyalty, and flashes of temper.",
    "Related": ["CHAR-001", "CHAR-003", "CHAR-007", "CHAR-026", "LOC-013", "QUEST-006"]
  },
  {
    "ID": "CHAR-003",
    "Type": "PC",
    "Name": "Fauda",
    "Content": "Human cleric and twin sister of Gloriosa, introduced in Session #1. Known for her calm compassion and divine curiosity. Her arc explores the Everbound faith, the disappearance of her niece Faudana, and the mystery of her own destiny as one ‘drawn to danger.’",
    "Related": ["CHAR-004", "CHAR-001", "CHAR-020", "CHAR-025", "LOC-002", "QUEST-004"]
  },
  {
    "ID": "CHAR-004",
    "Type": "PC",
    "Name": "Mask",
    "Content": "Changeling warlock introduced in Session #1. Pragmatic, secretive, and charismatic, Mask acts as the party’s negotiator and manipulator. They are linked to the entity Mira and maintain multiple personas including Flicker. Mask’s Sending spell communications are a recurring motif throughout the campaign.",
    "Related": ["CHAR-001", "CHAR-003", "CHAR-008", "CHAR-009", "LOC-004", "EVENT-007"]
  },
  {
    "ID": "CHAR-005",
    "Type": "PC",
    "Name": "Sili",
    "Content": "A satyr ranger and cleric of Azmir. Initially comic relief, Sili’s story turned darker after his faith was shaken by Elandra’s death. His devotion to the Hunt and his kinship with beasts often ground the group in natural wisdom.",
    "Related": ["CHAR-001", "CHAR-003", "CHAR-004", "LOC-011", "QUEST-005"]
  },
  {
    "ID": "CHAR-006",
    "Type": "NPC",
    "Name": "Lyza Truefoot",
    "Content": "Halfling fixer who first united the party at Thunder’s Respite (Session #1). Acts as the campaign’s inciting contact. She remains connected to the city’s underworld and occasionally reappears through intermediaries.",
    "Related": ["CHAR-001", "CHAR-002", "CHAR-004", "LOC-001", "EVENT-001"]
  },
  {
    "ID": "CHAR-007",
    "Type": "NPC",
    "Name": "Johnny Whisper",
    "Content": "Halfling information broker with a tattooed eye-and-gale sigil. Met in Session #9 at The Mothlight Inn, he offered the Keledar Codex job. Connected to Reve, Shay, and the Black Dove. Known for charm, danger, and ghostly moth familiars.",
    "Related": ["CHAR-008", "CHAR-009", "CHAR-010", "QUEST-001", "LOC-003"]
  },
  {
    "ID": "CHAR-008",
    "Type": "NPC",
    "Name": "Reve",
    "Content": "Red tiefling encountered at The Mothlight Inn (Session #9). Mysterious and flirtatious, seemingly aware of Dahlia’s changeling nature. Works with Johnny Whisper as a contact in Stormhaven’s underworld.",
    "Related": ["CHAR-007", "CHAR-009", "LOC-003", "EVENT-004"]
  },
  {
    "ID": "CHAR-009",
    "Type": "NPC",
    "Name": "Shay",
    "Content": "Eladrin patron at The Mothlight Inn (Session #9). Provided guidance and pointed the group to Reve. Acts as intermediary between Whisper’s network and adventurers.",
    "Related": ["CHAR-007", "CHAR-008", "LOC-003"]
  },
  {
    "ID": "CHAR-010",
    "Type": "NPC",
    "Name": "Lady Seriss Stormrider",
    "Content": "Noblewoman of Caeloria, target of Johnny Whisper’s information trade and later rescued from Mortimer’s Maze (Sessions #16–17). Stoic, proud, and pragmatic; obsessed with recovering the Stormheart Gem stolen by Zephara Moonveil.",
    "Related": ["CHAR-011", "CHAR-012", "CHAR-013", "QUEST-002", "LOC-010"]
  },
  {
    "ID": "CHAR-011",
    "Type": "NPC",
    "Name": "Zephara Moonveil",
    "Content": "Former friend of Lady Seriss and thief of the Stormheart Gem. Mentioned in Sessions #17–18. Charismatic, deceitful, and driven by survival instincts. Her betrayal catalyzes the Drifthold arc.",
    "Related": ["CHAR-010", "CHAR-012", "LOC-012", "QUEST-002"]
  },
  {
    "ID": "CHAR-012",
    "Type": "NPC",
    "Name": "Eldar Joven",
    "Content": "Mage of the Order of Stormhaven and father to Zephara. Contacted through Sending during the Archivum arc (Session #16). Cold and calculating, he betrayed the party by leaving them trapped with Mortimer.",
    "Related": ["CHAR-010", "CHAR-011", "CHAR-013", "EVENT-007"]
  },
  {
    "ID": "CHAR-013",
    "Type": "NPC",
    "Name": "Mortimer",
    "Content": "Disembodied head and necromantic scientist dwelling beneath the Archivum (Sessions #16–17). Former member of the Order who defied death and experimented on the living. Serves as the main antagonist of the Archivum arc.",
    "Related": ["CHAR-010", "CHAR-012", "LOC-010", "EVENT-007"]
  },
  {
    "ID": "CHAR-014",
    "Type": "NPC",
    "Name": "Dove (The Black Dove)",
    "Content": "Formerly a drow woman, now bound to a black bird. Ally summoned by Fauda via the obsidian feather during the Mortimer’s Maze battle. Wise, vengeful, and tied to Johnny Whisper’s network.",
    "Related": ["CHAR-007", "CHAR-010", "CHAR-013", "LOC-010", "EVENT-008"]
  },
  {
    "ID": "CHAR-015",
    "Type": "NPC",
    "Name": "Lady Eleanor Hargrave",
    "Content": "Half-elven noble of Stormhaven’s Pinnacle district. Married to Lord Edwin Hargrave. Consumed by strange southern faith and monstrous appetites. Central to the Hargrave Manor heist and tied to the Hollow Year myth.",
    "Related": ["CHAR-016", "CHAR-007", "LOC-005", "EVENT-005"]
  },
  {
    "ID": "CHAR-016",
    "Type": "NPC",
    "Name": "Lord Edwin Hargrave",
    "Content": "Reclusive noble who inherited Hargrave Manor. Husband to Lady Eleanor. Known for quiet intellect and isolation. Keeper of the Keledar Codex before the heist.",
    "Related": ["CHAR-015", "LOC-005", "QUEST-001"]
  },
  {
    "ID": "CHAR-017",
    "Type": "NPC",
    "Name": "Brea Tealeaf",
    "Content": "Halfling maid at Hargrave Manor. Daughter of Meriss Tealeaf, last seen years prior. The party’s visit to her mother revealed the manor’s growing horrors.",
    "Related": ["CHAR-018", "CHAR-015", "LOC-005"]
  },
  {
    "ID": "CHAR-018",
    "Type": "NPC",
    "Name": "Meriss Tealeaf",
    "Content": "Elderly halfling woman living in the Shaded Warrens. Mother of Brea. Provided the party insight into her daughter’s employment and Lady Eleanor’s monstrous habits.",
    "Related": ["CHAR-017", "LOC-002", "EVENT-003"]
  },
  {
    "ID": "CHAR-019",
    "Type": "NPC",
    "Name": "Rory",
    "Content": "Arc’s deceased friend, now a ghost bound to the Ghost King by spectral chains (Session #22). Appears intermittently to guide and comfort Arc.",
    "Related": ["CHAR-001", "CHAR-020", "LOC-011", "EVENT-011"]
  },
  {
    "ID": "CHAR-020",
    "Type": "NPC",
    "Name": "The Ghost King (The Roseheart King)",
    "Content": "Ancient monarch of Virelka whose body lies entombed and whose spirit binds other ghosts. His sigil—a rose within a heart—links to Rory’s curse and Arc’s emerging destiny.",
    "Related": ["CHAR-019", "LOC-011", "QUEST-005"]
  },
  {
    "ID": "CHAR-021",
    "Type": "NPC",
    "Name": "Thandor Greenbow",
    "Content": "Wood elf ranger and mentor encountered in the Greenmurk forest (Session #22). Seeks revenge against the lightning serpent known as The Protector. Honorable and skilled, he shares Fauda’s faith in the Everbound.",
    "Related": ["CHAR-003", "LOC-011", "EVENT-010"]
  },
  {
    "ID": "CHAR-022",
    "Type": "NPC",
    "Name": "The Protector",
    "Content": "A massive lightning serpent haunting the Greenmurk. Worshipped and feared by locals. The subject of Thandor’s lifelong hunt and the party’s joint expedition.",
    "Related": ["CHAR-021", "LOC-011", "EVENT-010"]
  },
  {
    "ID": "CHAR-023",
    "Type": "NPC",
    "Name": "Mira",
    "Content": "Mysterious voice in Fauda’s mind claiming kinship with her sister. Speaks cryptically about fate and danger. Likely a divine or extraplanar entity.",
    "Related": ["CHAR-003", "CHAR-025", "EVENT-012"]
  },
  {
    "ID": "CHAR-024",
    "Type": "NPC",
    "Name": "Jin",
    "Content": "An associate of Mask’s past, referenced through Sending messages. Connection to the Gloomwatch Sanctum and Flicker persona. Represents Mask’s emotional anchor.",
    "Related": ["CHAR-004", "LOC-014", "EVENT-012"]
  },
  {
    "ID": "CHAR-025",
    "Type": "NPC",
    "Name": "Gloriosa",
    "Content": "Fauda’s twin sister, reintroduced in later sessions (27–32). Driven to find her missing daughter, Faudana. Shares the Everbound sigil and mirrors Fauda’s courage and guilt.",
    "Related": ["CHAR-003", "CHAR-023", "CHAR-026", "QUEST-004"]
  },
  {
    "ID": "CHAR-026",
    "Type": "NPC",
    "Name": "Voraxik Valarnn",
    "Content": "Dragonborn rival of Vyphira, sold her stolen armor and tools to Shieldweaver’s Forge in Tempest’s Refuge (Session #28). Reckless and ambitious smith seeking fame.",
    "Related": ["CHAR-002", "LOC-013", "EVENT-014"]
  },
  {
    "ID": "CHAR-027",
    "Type": "NPC",
    "Name": "Sorrax Shieldweaver",
    "Content": "Red Dragonborn armorer and owner of Shieldweaver’s Forge in Tempest’s Refuge. Victim of tool theft tied to Vyphira’s past. Helpful and proud of his craft.",
    "Related": ["CHAR-002", "CHAR-026", "LOC-013"]
  },
  {
    "ID": "CHAR-028",
    "Type": "NPC",
    "Name": "Kharzid Tazek",
    "Content": "Earth Dragonborn thief from Tempest’s Watch, accomplice of Shavara Sablefang and part of the heist that stole Shieldweaver’s tools.",
    "Related": ["CHAR-029", "CHAR-002", "LOC-013"]
  },
  {
    "ID": "CHAR-029",
    "Type": "NPC",
    "Name": "Shavara Sablefang",
    "Content": "Gemstone Dragonborn thief and partner of Kharzid Tazek. Involved in the Tempest’s Refuge thefts linked to Vy’s storyline.",
    "Related": ["CHAR-028", "CHAR-002", "LOC-013"]
  },
  {
    "ID": "CHAR-030",
    "Type": "NPC",
    "Name": "Flora",
    "Content": "Priestess of Yondar in Tempest’s Refuge. Aids the party in atonement and restoration after Elandra’s death. Represents faith and forgiveness.",
    "Related": ["CHAR-003", "CHAR-004", "LOC-013"]
  }
]
