[
  {
    "ID": "CHAR-001",
    "Type": "PC",
    "Name": "Mask",
    "Session": "1",
    "Content": "Changeling who appears as a shifting humanoid figure with no fixed appearance. Former agent of The Gale who rebelled after gaining magical abilities from being struck by lightning, which also gave them a vision of Solara. Suffers from fractured mind and memory issues. Primary goal is to break free from The Gale's control, understand their origins, and heal their fractured mind. Affiliation with The Gale has been severed after slashing their tattoo and openly defying them. Worships the moon goddess Tana. Notable capabilities include powerful fire magic, spellcasting, and the ability to shift between multiple distinct personas: Flicker, Sage, Dahlia, Grit, and Granny. Key contributions include revealing The Gale's operations, protecting changeling refugees, and confronting the parasitic persona Fendril in mindscape battles. Current status: Mental control restored after defeating Fendril, but quest for complete understanding continues.",
    "Related": ["CHAR-007", "CHAR-008", "CHAR-021", "CHAR-025", "CHAR-026", "CHAR-027", "CHAR-028", "CHAR-043", "CHAR-046", "CHAR-069", "CHAR-070", "CHAR-077", "ITEM-001", "ITEM-002", "ITEM-003", "ITEM-004", "ITEM-005", "ITEM-006", "ITEM-007", "ITEM-010", "LOC-001", "LOC-002", "LOC-003", "LOC-008", "LOC-009", "LOC-010", "LOC-012", "LOC-013", "LOC-015", "LOC-017", "LOC-028", "LOC-029", "LOC-030", "LOC-031", "LOC-035", "LOC-036", "LOC-037", "LOC-038", "LOC-039", "EVENT-001", "EVENT-002", "EVENT-003", "EVENT-005", "EVENT-006", "EVENT-007", "EVENT-008", "EVENT-009", "EVENT-010", "EVENT-011", "EVENT-013", "EVENT-014", "EVENT-016", "EVENT-017", "EVENT-019", "EVENT-020", "EVENT-021", "EVENT-022", "EVENT-023", "EVENT-030", "EVENT-031", "EVENT-032", "EVENT-035", "EVENT-036", "EVENT-037", "EVENT-039", "EVENT-040", "QUEST-001", "QUEST-003", "QUEST-005", "QUEST-006", "QUEST-011", "QUEST-012", "QUEST-013"]
  },
  {
    "ID": "CHAR-002",
    "Type": "PC",
    "Name": "Fauda",
    "Session": "1",
    "Content": "Tiefling with distinctive horns and red skin, though her sister Gloriosa now has blue skin. Skilled spellcaster who grew up on a farm near Tallyport with her twin sister. Carries guilt over Elandra Hallowheart's murder, for which she seeks redemption from Yondar. Primary goal is to protect her friends and reconcile with her sister. Affiliation with The Gale through former romantic involvement with Pinglin Gale, now severed. Notable capabilities include enchantment magic, communication spells, deception, and loyalty to her companions. Key contributions include strategic spellcasting in combat, gathering information, and maintaining party cohesion during crises. After leaving her sister, she lived in The Haven with her friend Olga Patter.In Session 44, successfully negotiated with The Glint Syndicate to secure 'Rusty' Lou's assistance. Current status: Alive, reconciled with Gloriosa, and seeking redemption.",
    "Related": ["CHAR-001", "CHAR-003", "CHAR-012", "CHAR-021", "CHAR-029", "CHAR-046", "CHAR-069", "CHAR-070", "ITEM-001", "ITEM-002", "ITEM-003", "ITEM-004", "ITEM-005", "ITEM-006", "ITEM-007", "ITEM-008", "ITEM-010", "LOC-001", "LOC-002", "LOC-003", "LOC-008", "LOC-009", "LOC-010", "LOC-018", "LOC-019", "LOC-021", "LOC-022", "LOC-030", "LOC-032", "LOC-033", "EVENT-001", "EVENT-002", "EVENT-005", "EVENT-006", "EVENT-007", "EVENT-008", "EVENT-009", "EVENT-010", "EVENT-011", "EVENT-012", "EVENT-013", "EVENT-014", "EVENT-019", "EVENT-020", "EVENT-021", "EVENT-025", "EVENT-028", "EVENT-029", "EVENT-030", "EVENT-031", "EVENT-037", "EVENT-039", "EVENT-040", "EVENT-042", "QUEST-001", "QUEST-002", "QUEST-003", "QUEST-007", "QUEST-008", "QUEST-011", "QUEST-016", "QUEST-017"]
  },
  {
    "ID": "CHAR-003",
    "Type": "PC",
    "Name": "Vyphira",
    "Session": "1",
    "Content": "Dragonborn with distinctive scales, skilled artisan and warrior from Tempest's Watch. Practical and determined, with a strong sense of justice. Primary goal is to recover her stolen craftsmanship and tools, and understand her Dragonborn heritage. Notable capabilities include exceptional armor craftsmanship, combat skills, Draconic language knowledge, and armor creation. Key contributions include crafting armor for the party, combat prowess, and translating Draconic texts and conversations that revealed crucial plot information about dragon cults and ancient history. Carries guilt over Elandra Hallowheart's murder and seeks redemption. Current status: Alive, successfully recovered one set of tools, and pursuing the Beholder mastermind.",
    "Related": ["CHAR-001", "CHAR-002", "CHAR-004", "CHAR-016", "CHAR-017", "CHAR-018", "CHAR-019", "CHAR-020", "CHAR-030", "CHAR-031", "CHAR-046", "CHAR-069", "CHAR-070", "ITEM-001", "ITEM-002", "ITEM-003", "ITEM-004", "ITEM-005", "ITEM-006", "ITEM-007", "ITEM-009", "ITEM-010", "LOC-001", "LOC-002", "LOC-004", "LOC-005", "LOC-008", "LOC-019", "LOC-027", "LOC-034", "EVENT-001", "EVENT-002", "EVENT-009", "EVENT-011", "EVENT-015", "EVENT-018", "EVENT-019", "EVENT-020", "EVENT-021", "EVENT-027", "EVENT-030", "EVENT-031", "EVENT-037", "EVENT-038", "EVENT-039", "EVENT-040", "EVENT-042", "QUEST-002", "QUEST-003", "QUEST-011", "QUEST-017"]
  },
  {
    "ID": "CHAR-004",
    "Type": "PC",
    "Name": "Arc en Ciel",
    "Session": "1",
    "Content": "Skilled martial artist and dancer with supernatural flexibility - joints shift impossibly, arms/legs stretch like rubber, can extend/retract bones. Race unknown. Pragmatic, observant, gourmet who prefers fresh meat simply grilled. Background: Parents killed for trespassing on hunting territory, raised by abusive relatives. Left to wander, worked as sailor, met dancer Rory who became best friend. After Rory's death and killing her manipulator Jack, trained in martial arts with mysterious beggar mentor. Primary goal is to protect party she considers family and find her place. Secondary goal: free Rory's ghost from the Roseheart King. No strong affiliations. Notable capabilities: supernatural flexibility combat, cooking, sailing, dance. Current status: Alive, loyal to party, seeking to free Rory.",
    "Related": ["CHAR-001", "CHAR-002", "CHAR-003", "CHAR-005", "CHAR-011", "CHAR-038", "CHAR-066", "CHAR-067", "CHAR-068", "CHAR-069", "CHAR-070", "ITEM-001", "ITEM-002", "ITEM-003", "ITEM-004", "ITEM-005", "ITEM-006", "ITEM-007", "ITEM-010", "LOC-001", "LOC-002", "LOC-003", "LOC-006", "LOC-008", "LOC-009", "LOC-013", "LOC-019", "LOC-040", "EVENT-001", "EVENT-002", "EVENT-005", "EVENT-008", "EVENT-019", "EVENT-026", "EVENT-027", "EVENT-030", "EVENT-031", "EVENT-034", "EVENT-037", "EVENT-039", "EVENT-040", "EVENT-041", "EVENT-042", "QUEST-003", "QUEST-009", "QUEST-014", "QUEST-017"]
  },
  {
    "ID": "CHAR-005",
    "Type": "PC",
    "Name": "Sili",
    "Session": "1",
    "Content": "Nature-connected character with bond to animals and the god Azmir. Developed his connection in his wilderness home. Contemplative and spiritual, struggling with the moral implications of killing innocents. Primary goal is to appease his god Azmir through a worthy hunt and protect natural balance. Notable capabilities include nature magic, animal communication, tracking, and the Entangle spell. Key contributions include controlling battlefield terrain, healing party members, and establishing communication with natural creatures. His outposts at Cloudfoot Keep reported beings tracking the party. Current status: Alive, seeking a worthy hunt to atone for Elandra's murder.",
    "Related": ["CHAR-001", "CHAR-002", "CHAR-003", "CHAR-004", "CHAR-008", "CHAR-046", "CHAR-069", "CHAR-070", "ITEM-001", "ITEM-002", "ITEM-003", "ITEM-004", "ITEM-005", "ITEM-006", "ITEM-007", "ITEM-010", "LOC-001", "LOC-002", "LOC-003", "LOC-006", "LOC-008", "LOC-019", "LOC-041", "EVENT-001", "EVENT-002", "EVENT-006", "EVENT-009", "EVENT-019", "EVENT-020", "EVENT-021", "EVENT-027", "EVENT-030", "EVENT-031", "EVENT-037", "EVENT-039", "EVENT-040", "EVENT-041", "EVENT-042", "QUEST-003", "QUEST-004", "QUEST-011", "QUEST-017"]
  },
  {
    "ID": "CHAR-006",
    "Type": "NPC",
    "Name": "Lady Seriss",
    "Session": "16",
    "Content": "Met in Sessions 16-18 when she joined the party. Noblewoman from House Stormrider, elegant and composed despite danger. Primary goal is to survive and maintain her noble responsibilities while being targeted by various factions. Currently held captive by The Gale operative. Affiliation with House Stormrider remains strong. Notable capabilities include noble diplomacy, strategic thinking, and resilience under pressure. During encounters, she provided noble connections and strategic advice, was nearly killed by cannibals, and was taken hostage by The Gale operative who seems to harbor particular hatred toward her. In Session 45, communicated via message that she is being fitted for a wedding gown and is to be married to a prince in one of Solara's Bottle Kingdoms, identified by a mountain with a handsome face carved into it. Current status: Alive, held captive in Solara, being prepared for an arranged marriage.",
    "Related": ["CHAR-001", "CHAR-002", "CHAR-004", "CHAR-005", "CHAR-007", "CHAR-008", "CHAR-025", "CHAR-060", "CHAR-067", "ITEM-001", "ITEM-004", "LOC-001", "LOC-002", "LOC-003", "LOC-006", "LOC-031", "EVENT-001", "EVENT-002", "EVENT-005", "EVENT-007", "EVENT-031", "EVENT-035", "EVENT-037", "QUEST-003", "QUEST-005", "QUEST-013"]
  },
  {
    "ID": "CHAR-007",
    "Type": "NPC",
    "Name": "Elandra Hallowheart",
    "Session": "26",
    "Content": "Met in Session 26 at Tranquil Hollow Healing House in Tempest's Refuge. Human female, young beautiful healer with staff topped with ever-burning flame, wears sigil of Yondar. Chosen of Yondar, daughter of Luminarch Velma Hallowheart and Lord Preston Hallowheart of Thornheath. Kind, dedicated healer who helped diagnose Mask's condition. Murdered by party but resurrected. Now transformed through rebirth - taller, radiant, impossibly pure. Communicated with the party from Yondar's Flame Realm to offer redemption. Alive and currently in Tempest's Refuge helping city recover from giant attacks.",
    "Related": ["CHAR-001", "CHAR-002", "CHAR-006", "CHAR-009", "CHAR-025", "CHAR-026", "CHAR-027", "CHAR-053", "CHAR-054", "CHAR-055", "LOC-003", "LOC-009", "LOC-012", "LOC-024", "LOC-029", "EVENT-002", "EVENT-005", "EVENT-006", "EVENT-008", "EVENT-017", "QUEST-001", "QUEST-011"]
  },
  {
    "ID": "CHAR-008",
    "Type": "NPC",
    "Name": "The Gale Operative (Slender Man)",
    "Session": "27",
    "Content": "Met in Session 27 in Tempest's Refuge residential district. Tall thin man with low hat, dark sunglasses, scarf over face, unsettling pitch black eyes with white pinpricks. Overwhelming smell of flowers mixed with rotting stench. Covered with Gale tattoos. Angry, manipulative, all-seeing power through scrying. Captured Lady Seriss. Revealed he had been watching party's activities including dealings with Johnny Whispers and Eldar Joven. Forced party to find Flora Mourne. Is the target of Sili's worthy hunt for Azmir. Current status: Alive, holding Lady Seriss captive.",
    "Related": ["CHAR-001", "CHAR-005", "CHAR-006", "CHAR-009", "CHAR-025", "CHAR-026", "CHAR-056", "CHAR-057", "LOC-003", "LOC-023", "EVENT-007", "EVENT-009", "EVENT-011", "EVENT-032", "EVENT-033", "EVENT-036", "QUEST-004", "QUEST-005"]
  },
  {
    "ID": "CHAR-009",
    "Type": "NPC",
    "Name": "Flora Mourne",
    "Session": "27",
    "Content": "Met in Session 27 outside Tranquil Hollow after witnessing Elandra's murder. Human female with both arms amputated, replaced by magical blue Mage Hands. Wears gold and platinum necklace shaped like Yondar's flame. Close friend and roommate of Elandra Hallowheart. Determined humanitarian smuggling changelings to safety. Uses Dimension Door and ghostly transformation abilities from magic that saved her after accident. Currently alive and continuing her work helping refugees.",
    "Related": ["CHAR-001", "CHAR-007", "CHAR-008", "CHAR-010", "CHAR-011", "CHAR-025", "CHAR-026", "LOC-003", "LOC-009", "LOC-010", "EVENT-006", "EVENT-008", "EVENT-009", "EVENT-010", "QUEST-005", "QUEST-006"]
  },
  {
    "ID": "CHAR-010",
    "Type": "NPC",
    "Name": "Drayce Goldmere",
    "Session": "28",
    "Content": "Met in Session 28 behind Tranquil Hollow in Tempest's Refuge. Half-human, half-hobgoblin mage, apprentice to Oswin Fellcrest, son of the mayor. In love with Flora Mourne. Helped Flora and Elandra by moving guards for their smuggling operations. Confused but helpful, eventually aided party against The Gale forces. Specializes in stone magic. Currently alive and maintaining his position in Tempest's Refuge.",
    "Related": ["CHAR-007", "CHAR-009", "CHAR-011", "LOC-003", "LOC-009", "LOC-010", "EVENT-009", "EVENT-010", "EVENT-011", "QUEST-006"]
  },
  {
    "ID": "CHAR-011",
    "Type": "NPC",
    "Name": "Oswin Fellcrest",
    "Session": "28",
    "Content": "Met in Session 28 during investigation of Elandra's murder. Head mage of Tempest's Refuge, uncle to Flora Mourne. Specializes in stone magic, capable of molding and shaping stone at will. Professional and authoritative, but showed attraction to Arc en Ciel. Currently alive and maintaining his position as head mage.",
    "Related": ["CHAR-004", "CHAR-009", "CHAR-010", "LOC-003", "EVENT-009", "EVENT-010"]
  },
  {
    "ID": "CHAR-012",
    "Type": "NPC",
    "Name": "Gloriosa",
    "Session": "30",
    "Content": "Met in Session 30 in Drifthold magistrate's office. Tiefling, Fauda's twin sister, now with blue skin instead of red. Prophet of Nyxara and head priest of the supposedly dead god. Mother of two children - Faudana and Rowan. Complicated relationship with Fauda, estranged for nearly 20 years. Religious, determined, carrying deep family burdens. Performed the mindscape ritual that helped heal Mask. Currently alive and searching for her missing daughter in Solara.",
    "Related": ["CHAR-002", "CHAR-029", "CHAR-032", "CHAR-033", "CHAR-048", "CHAR-049", "CHAR-059", "ITEM-008", "LOC-008", "LOC-011", "LOC-018", "LOC-021", "LOC-022", "LOC-026", "LOC-033", "EVENT-012", "EVENT-013", "EVENT-016", "EVENT-025", "EVENT-028", "QUEST-001", "QUEST-007", "QUEST-016"]
  },
  {
    "ID": "CHAR-013",
    "Type": "NPC",
    "Name": "Veil",
    "Session": "29",
    "Content": "Met in Session 29 in church basement safe-room in Tempest's Refuge. Changeling female, heavily pregnant, scarred at wrists and ankles from prolonged captivity by The Gale. Kind but firm, spent years working for The Gale before being used to produce more changelings. Explained The Gale's brainwashing of changeling children. Currently alive and safely escaped to Drifthold's Tailstride with other changeling refugees.",
    "Related": ["CHAR-001", "CHAR-014", "CHAR-015", "CHAR-025", "LOC-010", "LOC-025", "LOC-030", "EVENT-010", "EVENT-014", "QUEST-006"]
  },
  {
    "ID": "CHAR-014",
    "Type": "NPC",
    "Name": "Shagra Wordbinder",
    "Session": "29",
    "Content": "Met in Session 29 in church basement. Orcish woman, priestess of Shy'rah, the Tusked Mother. Protective and distrustful of party initially. Wife of Drath Wordbinder, helping smuggle changelings to safety. Currently alive and safely in Drifthold.",
    "Related": ["CHAR-013", "CHAR-015", "LOC-010", "LOC-025", "LOC-030", "EVENT-010", "EVENT-014", "QUEST-006"]
  },
  {
    "ID": "CHAR-015",
    "Type": "NPC",
    "Name": "Drath Wordbinder",
    "Session": "29",
    "Content": "Met in Session 29 in church basement. Orcish man, professor and expert in Runic Theory from Drifthold. Husband of Shagra, uses rune-inscribed tent that provides storm protection and invisibility. Little magical ability himself, focuses on runic theory. Currently alive and teaching at Drifthold university, where he tutors the party in runic theory.",
    "Related": ["CHAR-013", "CHAR-014", "LOC-008", "LOC-010", "LOC-020", "LOC-025", "LOC-030", "EVENT-010", "EVENT-014", "EVENT-029", "QUEST-006", "QUEST-008"]
  },
  {
    "ID": "CHAR-016",
    "Type": "NPC",
    "Name": "Sorrax Shieldweaver",
    "Session": "29",
    "Content": "Met in Session 29 at Shieldweaver's Armorer & Forge in Tempest's Refuge. Heavy-set red Dragonborn, devastated by theft of family heirloom tools. Owns one of three known sets of special tools with distinctive maker's mark. Helpful and appreciative when Vyphira promised to recover his tools. Currently alive and running his forge.",
    "Related": ["CHAR-003", "CHAR-017", "CHAR-018", "CHAR-030", "CHAR-031", "ITEM-009", "LOC-004", "EVENT-015", "QUEST-002"]
  },
  {
    "ID": "CHAR-017",
    "Type": "NPC",
    "Name": "Garman",
    "Session": "29",
    "Content": "Met in Session 29 at Shieldweaver's Armorer & Forge. Slender black Dragonborn with scorch marks, worked at counter. Offered to sell Vyphira's own stolen armor back to her. Employee of Sorrax Shieldweaver. Currently alive.",
    "Related": ["CHAR-003", "CHAR-016", "LOC-004", "EVENT-015"]
  },
  {
    "ID": "CHAR-018",
    "Type": "NPC",
    "Name": "Voraxik Valarnn",
    "Session": "29",
    "Content": "Finally encountered directly in Session 41 during Ironhowl Forge theft. Young Dragonborn from Tempest's Watch who grew up with Vyphira. Shocked to see Vy, refused to strike her directly during fight. Revealed he, Shavara, and Kharzid were forced into thefts by a Beholder who caught them robbing its vault. The Beholder is collecting complete sets of special tools and threatened to kill them and possibly Vy's entire town if they refused. Sold Vyphira's armor to Sorrax Shieldweaver. Associated with Kharzid Tazek and Shavara Sablefang. In Session 42, was interrogated and corroborated Shavara's story before being imprisoned for 'correction' by Edrin Locke. Current status: Soul imprisoned for correction, body in stasis.",
    "Related": ["CHAR-003", "CHAR-016", "CHAR-019", "CHAR-020", "CHAR-030", "CHAR-031", "CHAR-062", "CHAR-064", "CHAR-065", "CHAR-068", "ITEM-009", "LOC-004", "LOC-005", "LOC-034", "EVENT-015", "EVENT-037", "EVENT-038", "EVENT-039", "QUEST-002"]
  },
  {
    "ID": "CHAR-019",
    "Type": "NPC",
    "Name": "Kharzid Tazek",
    "Session": "29",
    "Content": "Never met directly, but discussed in Session 29. Earth Dragonborn, sandy-colored. Grew up with Vyphira in Tempest's Watch. Known troublemaker with powerful associates. Stole Sorrax Shieldweaver's tools with Shavara Sablefang. Part of the team that attempted to steal from Ironhowl Forge. Current status: Deceased, killed during the Ironhowl Forge ambush.",
    "Related": ["CHAR-003", "CHAR-016", "CHAR-018", "CHAR-020", "CHAR-031", "ITEM-009", "LOC-004", "LOC-034", "EVENT-015", "EVENT-038", "QUEST-002"]
  },
  {
    "ID": "CHAR-020",
    "Type": "NPC",
    "Name": "Shavara Sablefang",
    "Session": "29",
    "Content": "Never met directly, but discussed in Session 29. Gemstone Dragonborn, white with gemstone scales. Grew up with Vyphira in Tempest's Watch. Known troublemaker, partner of Kharzid Tazek. Stole Sorrax Shieldweaver's tools. Part of the team that attempted to steal from Ironhowl Forge. In Session 42, was interrogated and revealed the Beholder's name as Xyrx the Collector before being imprisoned for 'correction' by Edrin Locke. Current status: Soul imprisoned for correction, body in stasis.",
    "Related": ["CHAR-003", "CHAR-016", "CHAR-018", "CHAR-019", "CHAR-031", "CHAR-068", "ITEM-009", "LOC-004", "LOC-034", "EVENT-015", "EVENT-038", "EVENT-039", "QUEST-002"]
  },
  {
    "ID": "CHAR-021",
    "Type": "NPC",
    "Name": "Jin",
    "Session": "31",
    "Content": "Met in Session 31 in Mask's mindscape during Fendril confrontation. Changeling, Mask's friend from Gale training facility. Parents were present at facility, spent considerable time with Mask. Both received Gale tattoos - Jin's on left hand, Mask's on right. Appeared in memory sequences helping party against Fendril. Current real-world status unknown.",
    "Related": ["CHAR-001", "CHAR-022", "CHAR-025", "LOC-028", "LOC-035", "EVENT-016", "EVENT-023"]
  },
  {
    "ID": "CHAR-022",
    "Type": "NPC",
    "Name": "Fendril",
    "Session": "31",
    "Content": "Met in Session 31 in Mask's mindscape. Parasitic entity, fragmented version of Mask's original persona that gained sentience and independence. Hideous creature with many rotating faces, covered in mouths. Represented Mask's self-doubt and abandoned identity. Defeated by party in mindscape battle. Status: Destroyed in mindscape, no longer threatening Mask's sanity.",
    "Related": ["CHAR-001", "CHAR-021", "CHAR-024", "CHAR-051", "LOC-028", "LOC-036", "EVENT-003", "EVENT-016", "QUEST-001"]
  },
  {
    "ID": "CHAR-023",
    "Type": "NPC",
    "Name": "Urdesh Darkmoore",
    "Session": "31",
    "Content": "Met in Session 31 in Mask's mindscape training memory. Shadar-Kai trainer at Gale facility, brutal but fair. Instructed children in knife throwing, disguise, pick-pocketing. Most honorable trainer at facility. Appeared as memory combatant against party. Status: Memory entity, real-world status unknown.",
    "Related": ["CHAR-001", "CHAR-021", "LOC-028", "LOC-035", "EVENT-016", "EVENT-023"]
  },
  {
    "ID": "CHAR-024",
    "Type": "NPC",
    "Name": "Miss Amber",
    "Session": "31",
    "Content": "Met in Session 31 in Mask's mindscape orphanage memory. Woman who ran orphanage where Mask was left as baby. Called Mask 'Fendril' originally. Appeared as memory figure corrupted by Fendril entity. Status: Memory entity, real-world status unknown.",
    "Related": ["CHAR-001", "CHAR-022", "LOC-028", "LOC-036", "EVENT-016", "EVENT-023"]
  },
  {
    "ID": "CHAR-025",
    "Type": "Organization",
    "Name": "The Gale",
    "Session": "27",
    "Content": "First encountered in Session 27 through operative in Tempest's Refuge. Organization of spies serving Solara, managing matters on Eryndor to ensure nothing grows out of control. Uses brainwashing and recruitment of changeling children at their training facility. Headquarters believed to be in Solara. Led by unknown leadership. Key interactions: party murdered their ally Elandra, Mask slashed their tattoo in defiance, they captured Lady Seriss. Current status: Actively hunting Mask and party after their rebellion, relationship hostile.",
    "Related": ["CHAR-001", "CHAR-002", "CHAR-006", "CHAR-007", "CHAR-008", "CHAR-009", "CHAR-013", "CHAR-021", "CHAR-029", "CHAR-050", "CHAR-056", "CHAR-057", "ITEM-001", "ITEM-004", "ITEM-006", "LOC-003", "LOC-011", "LOC-023", "LOC-035", "EVENT-007", "EVENT-009", "EVENT-011", "EVENT-032", "EVENT-033", "EVENT-035", "EVENT-036", "QUEST-005", "QUEST-012", "QUEST-013"]
  },
  {
    "ID": "CHAR-026",
    "Type": "Organization",
    "Name": "Yondari Faith",
    "Session": "26",
    "Content": "First encountered in Session 26 through Elandra Hallowheart at Tranquil Hollow. Religious organization worshipping Yondar, the Everflame. Focus on redemption, light, and moral rigidity. Led by Luminarch Velma Hallowheart. Headquarters in Thornheath, northern city. Major temple in Drifthold called The Ever-Burning Temple. Key interactions: party murdered their Chosen, Elandra, but were offered a path to redemption through trials. Current status: Neutral to party, offering path to redemption despite Elandra's murder.",
    "Related": ["CHAR-001", "CHAR-007", "CHAR-008", "CHAR-009", "CHAR-027", "CHAR-028", "CHAR-034", "CHAR-052", "CHAR-053", "CHAR-054", "LOC-009", "LOC-012", "LOC-024", "LOC-029", "EVENT-005", "EVENT-006", "EVENT-008", "EVENT-017", "QUEST-001", "QUEST-011"]
  },
  {
    "ID": "CHAR-027",
    "Type": "NPC",
    "Name": "Yondar, the Everflame",
    "Session": "26",
    "Content": "Deity, never physically met but communicated through Elandra Hallowheart and temple flames. God of fire, light, and redemption. Former lover of Tana according to rumors. Twin brother of Yeldur. Forbids his followers from bringing faith to Solara. Offers redemption through three trials. Current status: Divine being, communicating through chosen followers.",
    "Related": ["CHAR-007", "CHAR-026", "CHAR-028", "CHAR-033", "CHAR-034", "CHAR-043", "CHAR-052", "CHAR-055", "LOC-012", "LOC-029", "EVENT-017", "QUEST-001", "QUEST-011", "QUEST-012"]
  },
  {
    "ID": "CHAR-028",
    "Type": "NPC",
    "Name": "Tana",
    "Session": "1",
    "Content": "Deity, never physically met. Moon goddess worshipped by Mask, shattered but not dead. Essence scattered throughout world, strongest in Solara. Rumored former lover of Yondar, may have produced divine offspring. Shattered herself willingly according to Yondar. Current status: Divine essence scattered, worshipped by followers including Mask. The truth of her shattering is a key quest.",
    "Related": ["CHAR-001", "CHAR-026", "CHAR-027", "CHAR-033", "CHAR-034", "CHAR-043", "CHAR-052", "LOC-011", "EVENT-003", "EVENT-017", "EVENT-022", "QUEST-001", "QUEST-012"]
  },
  {
    "ID": "CHAR-029",
    "Type": "NPC",
    "Name": "Pinglin Gale",
    "Session": "30",
    "Content": "Never met directly, discussed by Fauda. Tiefling member of The Gale, former romantic involvement with Fauda. Was using Fauda to try to track down Gloriosa. Current status: Alive, whereabouts unknown.",
    "Related": ["CHAR-002", "CHAR-012", "CHAR-025"]
  },
  {
    "ID": "CHAR-030",
    "Type": "NPC",
    "Name": "Torva Ironhowl",
    "Session": "39",
    "Content": "Met in Session 39 at Ironhowl Forge in Drifthold. Grizzled black Dragonborn with long white beard, carries three heirloom tools on belt. Owner of Ironhowl Forge, possesses one of three known sets of special tools. From Thunder Wastes, displays dead thieves outside forge. Helped party set trap for Voraxik. Currently alive and running his forge.",
    "Related": ["CHAR-003", "CHAR-016", "CHAR-018", "ITEM-009", "LOC-005", "EVENT-018", "QUEST-002"]
  },
  {
    "ID": "CHAR-031",
    "Type": "NPC",
    "Name": "Voraxik Valarnn Associates",
    "Session": "29",
    "Content": "Group of Dragonborn thieves including Voraxik, Kharzid Tazek, and Shavara Sablefang. All grew up with Vyphira in Tempest's Watch. Known troublemakers boasting of powerful associates. Stole Vyphira's armor design and Sorrax's tools. Attempted to steal from Ironhowl Forge. Current status: Kharzid deceased, Voraxik and Shavara captured and soul-imprisoned.",
    "Related": ["CHAR-003", "CHAR-016", "CHAR-018", "CHAR-019", "CHAR-020", "ITEM-009", "LOC-004", "LOC-005", "LOC-034", "EVENT-015", "EVENT-038", "QUEST-002"]
  },
  {
    "ID": "CHAR-032",
    "Type": "NPC",
    "Name": "Broin",
    "Session": "30",
    "Content": "Never met directly, discussed by Gloriosa. High noble of Solara from House Duskvale. Father of Gloriosa's children Faudana and Rowan. Had relationships with both Fauda and Gloriosa without realizing they were twins. Currently alive in Solara with son Rowan, angry with Gloriosa.",
    "Related": ["CHAR-012", "CHAR-048", "CHAR-049", "LOC-011", "EVENT-025"]
  },
  {
    "ID": "CHAR-033",
    "Type": "NPC",
    "Name": "Nyxara",
    "Session": "30",
    "Content": "Deity, never physically met. Supposedly 'dead god' on Solara but actually alive according to Gloriosa. Connected to Tana's essence and power. Blue-skinned deity, Gloriosa is head priest. Worshippers scattered throughout Solara. Gloriosa believes Faudana's disappearance is connected to her. Current status: Divine being, actively worshipped by hidden followers.",
    "Related": ["CHAR-012", "CHAR-027", "CHAR-028", "CHAR-048", "LOC-011", "EVENT-025", "QUEST-007", "QUEST-012"]
  },
  {
    "ID": "CHAR-034",
    "Type": "NPC",
    "Name": "Yeldur",
    "Session": "40",
    "Content": "Deity, never physically met. God of darkness and chaos, Yondar's twin and opposite. Followers are anarchists and terrorists seeking apocalyptic war. Symbol seen on worshippers outside Ever-Burning Temple. Represents darkness, chaos, and the abyss. Current status: Divine being, worshipped by cultists seeking world-ending rebirth.",
    "Related": ["CHAR-026", "CHAR-027", "CHAR-028", "LOC-012", "EVENT-017"]
  },
  {
    "ID": "CHAR-035",
    "Type": "NPC",
    "Name": "Lord Halen Crimm (Shaemir)",
    "Session": "35",
    "Content": "Met in Session 35 at Crimm Manor in Drifthold's Sky Ward. Older refined man in fine clothing, actually ancient copper dragon in human form. Master of Crimm estate, oldest and most powerful of Sky Ward's twelve families. Originally from Solara, smuggled out as young dragon. Patron of arts, filled manor with artists and musicians. Grateful for daughter's rescue. Bestowed Draconic Boons upon the party. In Session 43, was away at an emergency meeting with the King of Drifthold regarding an emissary from Branthor the Thunderheart. In Session 44, communicated with the party about the ongoing negotiations and threat. Currently alive and maintaining power in Drifthold while dealing with the giant emissary crisis.",
    "Related": ["CHAR-036", "CHAR-037", "CHAR-038", "CHAR-039", "CHAR-040", "CHAR-044", "ITEM-010", "LOC-008", "LOC-013", "EVENT-019", "EVENT-021", "EVENT-027", "EVENT-042", "QUEST-009", "QUEST-017"]
  },
  {
    "ID": "CHAR-036",
    "Type": "NPC",
    "Name": "Alira Crimm",
    "Session": "37",
    "Content": "Met in Session 37 in dragon cult basilica. Twenty-year-old daughter of Lord Crimm, actually young copper dragon. Sweet, naïve, magically gifted, tutored by Teren Vallin. Sheltered upbringing, longed to create art. Kidnapped by dragon cult for blood ritual. Transformed to dragon form during rescue. Currently alive and safe at Crimm Manor.",
    "Related": ["CHAR-035", "CHAR-037", "CHAR-039", "CHAR-040", "CHAR-044", "ITEM-010", "LOC-013", "LOC-014", "EVENT-019", "EVENT-020", "EVENT-021", "QUEST-009"]
  },
  {
    "ID": "CHAR-037",
    "Type": "NPC",
    "Name": "Teren Vallin",
    "Session": "35",
    "Content": "Met in Session 35 at Crimm Manor. Purple-skinned man, Alira's magic tutor. Quiet, harbors personal feelings for Alira beyond tutoring. Mistrusts bards, particularly Derron Thane. Led party on dragonflies through Drifthold tiers. In Session 43, greeted the party at Crimm Manor and gathered information about 'Rusty' Lou for them. Currently alive and continuing as tutor.",
    "Related": ["CHAR-035", "CHAR-036", "CHAR-039", "LOC-013", "EVENT-019", "QUEST-009"]
  },
  {
    "ID": "CHAR-038",
    "Type": "NPC",
    "Name": "Tolliver",
    "Session": "35",
    "Content": "Met in Session 35 at Crimm Manor. Elderly kobold butler, refined despite primitive origins. Secured room when party revealed knowledge of Crimm's dragon nature. Appreciated Arc's raw liver snack offering. In Session 43, was away with Lord Crimm at the emergency meeting with the King. Currently alive and serving as Crimm Manor butler.",
    "Related": ["CHAR-004", "CHAR-035", "LOC-013", "EVENT-019", "EVENT-026"]
  },
  {
    "ID": "CHAR-039",
    "Type": "NPC",
    "Name": "Derron Thane",
    "Session": "36",
    "Content": "Met in Session 36 at The Silver Vein tavern. White-haired elf bard with mandolin, very handsome. Deep gambling debts, forced by Seroth Kael to seduce and kidnap Alira Crimm. Turned invisible during fights, transformed into Giant Ape when threatened. Feeling guilty, helped party rescue Alira. Currently alive, working for Lord Crimm to pay off debts.",
    "Related": ["CHAR-001", "CHAR-035", "CHAR-036", "CHAR-037", "CHAR-040", "CHAR-041", "LOC-013", "LOC-015", "EVENT-020", "EVENT-021", "QUEST-009"]
  },
  {
    "ID": "CHAR-040",
    "Type": "NPC",
    "Name": "Seroth Kael",
    "Session": "35",
    "Content": "Met in Session 35 at The Ashen Ledger. Finely dressed man, rude and condescending, actually horned draconian creature. Owner of The Ashen Ledger antiquities business. Introduced Derron Thane to Crimm household. Leader of dragon cult The Ashen Coil, planning to sacrifice Alira for ritual. Killed by party during rescue. Status: Deceased.",
    "Related": ["CHAR-035", "CHAR-036", "CHAR-039", "CHAR-041", "CHAR-044", "LOC-014", "LOC-016", "EVENT-020", "EVENT-021", "QUEST-009"]
  },
  {
    "ID": "CHAR-041",
    "Type": "NPC",
    "Name": "Brenna Kael",
    "Session": "35",
    "Content": "Met in Session 35 at The Ashen Ledger. Wife of Seroth Kael, arranging items on shelves. Arrogant but curious, discovered Derron Thane at The Silver Vein tavern. Involved in dragon cult activities with husband. Current status: Presumably deceased with husband during cult confrontation.",
    "Related": ["CHAR-039", "CHAR-040", "CHAR-044", "LOC-016", "EVENT-020", "QUEST-009"]
  },
  {
    "ID": "CHAR-042",
    "Type": "NPC",
    "Name": "The Black Dove",
    "Session": "38",
    "Content": "Met in Session 38 when summoned by Fauda's feather. Powerful entity from Stormhaven, arrives in flash of feathers. Bored demeanor, painting nails black when summoned. Helped party fight dragon cult and Ghost Dragon. Left another feather for future summons. Current status: Available for future summoning.",
    "Related": ["CHAR-002", "EVENT-021"]
  },
  {
    "ID": "CHAR-043",
    "Type": "NPC",
    "Name": "Liora Quillheart",
    "Session": "39",
    "Content": "Met in Session 39 at Mossgate Hollow penthouse. Elegant elven romance novelist, formerly history professor. Gaudy but immaculate fashion, deeply sensual demeanor. Author of Burning Moon trilogy about Tana and Yondar. Provided historical information about deities and The Lovers cult. In Session 42, hosted a gathering at her flat which Mask attended as Dahlia. Currently alive and writing in Drifthold.",
    "Related": ["CHAR-001", "CHAR-027", "CHAR-028", "CHAR-052", "LOC-017", "EVENT-022", "QUEST-001", "QUEST-012"]
  },
  {
    "ID": "CHAR-044",
    "Type": "Organization",
    "Name": "The Ashen Coil",
    "Session": "36",
    "Content": "First encountered in Session 36 through masked attackers at Silver Vein tavern. Dragon cult worshipping earth dragon Khaimyrax. Members have draconic features - scales, tails, breath weapons. Led by Seroth Kael, planning to raise Ghost Dragon using Alira Crimm's blood. Used Dragonborn blood supplements for rituals. Based out of The Ashen Ledger and The Hollow Basilica. Key interactions: kidnapped Alira Crimm, fought party in epic battle. Current status: Leadership destroyed, remnants possibly still active.",
    "Related": ["CHAR-035", "CHAR-036", "CHAR-039", "CHAR-040", "CHAR-041", "CHAR-045", "LOC-014", "LOC-015", "LOC-016", "EVENT-020", "EVENT-021", "QUEST-009"]
  },
  {
    "ID": "CHAR-045",
    "Type": "NPC",
    "Name": "Khaimyrax",
    "Session": "37",
    "Content": "Never met alive, encountered as skeleton in Session 37. Ancient earth dragon, deity worshipped by The Ashen Coil. Massive skeleton in Hollow Basilica temple. Ghost form raised during ritual, defeated by party. Current status: Deceased, ghost form destroyed.",
    "Related": ["CHAR-044", "LOC-014", "EVENT-021"]
  },
  {
    "ID": "CHAR-046",
    "Type": "NPC",
    "Name": "Jorren and Megara Vale",
    "Session": "30",
    "Content": "Never met directly, discussed as masters in Session 30. Gnome mage twins controlling one of Drifthold's walking legs, The Echoing Spire. Brutal leaders with army of goblins and orcs. Killed previous leg mage to claim control. Party bound to them by blood pact for city entry. Considered vile and unpredictable by Gloriosa. In Session 42, the party finally met them in their dining hall. They assigned the party new tasks after the blood pact completion: deal with a sewer mage and kill Garrick Rathorn. They threatened the party with grotesque experimentation. Current status: Alive, controlling leg of Drifthold. Party has an outstanding obligation to them.",
    "Related": ["CHAR-001", "CHAR-002", "CHAR-003", "CHAR-004", "CHAR-005", "CHAR-012", "CHAR-069", "CHAR-070", "CHAR-071", "LOC-008", "LOC-026", "EVENT-012", "EVENT-040", "QUEST-010", "QUEST-015"]
  },
  {
    "ID": "CHAR-047",
    "Type": "NPC",
    "Name": "Goblin Entry Master",
    "Session": "30",
    "Content": "Met in Session 30 at Drifthold entry platform. Elderly goblin woman in charge of city entry. Gleeful about combat entry requirement, verified Stormrider sigil pendant. Arranged blood pact with Vale mages. Current status: Alive, managing Drifthold entry.",
    "Related": ["CHAR-046", "LOC-008", "EVENT-012"]
  },
  {
    "ID": "CHAR-048",
    "Type": "NPC",
    "Name": "Faudana",
    "Session": "30",
    "Content": "Never met, discussed by Gloriosa. Gloriosa's missing daughter, blue-skinned like Nyxara's light. Named after Fauda. Vanished during lunar ceremony at age twelve. Believed connected to Nyxara, appears in dreams in blue place with silver pool. Current status: Missing for five years, whereabouts unknown. The focus of QUEST-007.",
    "Related": ["CHAR-002", "CHAR-012", "CHAR-032", "CHAR-033", "LOC-011", "EVENT-025", "QUEST-007", "QUEST-016"]
  },
  {
    "ID": "CHAR-049",
    "Type": "NPC",
    "Name": "Rowan",
    "Session": "30",
    "Content": "Never met, discussed by Gloriosa. Gloriosa's son, red-skinned like family. Seventeen years old, angry with mother, living with father Broin in Solara. Current status: Alive in Solara with father.",
    "Related": ["CHAR-012", "CHAR-032", "LOC-011", "EVENT-025"]
  },
  {
    "ID": "CHAR-050",
    "Type": "NPC",
    "Name": "Shasta",
    "Session": "30",
    "Content": "Never met, discussed by Mask in Session 30. Mask's handler at The Gale, became surrogate mother. Accepted Mask's leave of absence request unaware it wasn't allowed. Current status: Whereabouts unknown.",
    "Related": ["CHAR-001", "CHAR-025", "LOC-035", "EVENT-023"]
  },
  {
    "ID": "CHAR-051",
    "Type": "NPC",
    "Name": "Solenne",
    "Session": "32",
    "Content": "Met in Session 32 in Mask's mindscape memory of Stormsurge. Important memory figure from Mask's past, possibly romantic interest. Eyes pulsed between dull and bright as Mask and Fendril fought for control. Rescued from gallows fantasy by party. Current status: Memory entity, real-world status unknown.",
    "Related": ["CHAR-001", "CHAR-022", "LOC-028", "LOC-037", "EVENT-016"]
  },
  {
    "ID": "CHAR-052",
    "Type": "Organization",
    "Name": "The Lovers",
    "Session": "39",
    "Content": "Never encountered directly, discussed by Liora Quillheart. Religious faction derogatorily called 'The Lovers' - heretical sect of Tana worshippers obsessed with love between Tana and Yondar. Seek to speak with Yondar for answers about Tana's shattering. Clash with orthodox Yondari worshippers. Current status: Active, found near Yondari holy sites.",
    "Related": ["CHAR-026", "CHAR-027", "CHAR-028", "CHAR-043", "LOC-012", "EVENT-022", "QUEST-001", "QUEST-012"]
  },
  {
    "ID": "CHAR-053",
    "Type": "NPC",
    "Name": "Velma Hallowheart",
    "Session": "40",
    "Content": "Never met, discussed by Radiant priest. Luminarch, Voice of the Flame, highest priest of Yondar in entire church. Mother of Elandra, somewhat displeased with party for daughter's murder. Current status: Alive, leading Yondari faith from Thornheath.",
    "Related": ["CHAR-007", "CHAR-026", "LOC-024"]
  },
  {
    "ID": "CHAR-054",
    "Type": "NPC",
    "Name": "Preston Hallowheart",
    "Session": "40",
    "Content": "Never met, discussed by Radiant priest. Lord of Thornheath, northern city and birthplace of Yondar's faith. Father of Elandra, deeply devout, resentful of party for daughter's murder. Current status: Alive, noble in Thornheath.",
    "Related": ["CHAR-007", "CHAR-026", "LOC-024"]
  },
  {
    "ID": "CHAR-055",
    "Type": "NPC",
    "Name": "Darren Maximus",
    "Session": "40",
    "Content": "Never met, discussed by Elandra. Other living Chosen of Yondar, southerner from Lightning Fields. Destined to marry Elandra and produce children who might become Yondar's Champion. Current status: Alive, whereabouts unknown.",
    "Related": ["CHAR-007", "CHAR-027"]
  },
  {
    "ID": "CHAR-056",
    "Type": "NPC",
    "Name": "Johnny Whispers",
    "Session": "27",
    "Content": "Never met, discussed by Gale operative. Previous contact in Stormhaven who warned about The Gale. Had slashed his Gale tattoo like Mask later did. Current status: Whereabouts unknown.",
    "Related": ["CHAR-001", "CHAR-008", "CHAR-025", "ITEM-003", "LOC-023", "EVENT-032"]
  },
  {
    "ID": "CHAR-057",
    "Type": "NPC",
    "Name": "Eldar Joven",
    "Session": "27",
    "Content": "Never met, discussed by Gale operative. Previous confrontation mentioned by slender man, indicating Gale's surveillance of party. Current status: Whereabouts unknown.",
    "Related": ["CHAR-008", "CHAR-025", "ITEM-002", "EVENT-033"]
  },
  {
    "ID": "CHAR-058",
    "Type": "NPC",
    "Name": "Olga Patter",
    "Session": "30",
    "Content": "Never met, discussed by Fauda. Orcish woman, Fauda's friend and surrogate sister after leaving Gloriosa. Lived with Fauda in The Haven. Current status: Whereabouts unknown.",
    "Related": ["CHAR-002", "LOC-032"]
  },
  {
    "ID": "CHAR-059",
    "Type": "NPC",
    "Name": "Gloriosa's Acolytes",
    "Session": "30",
    "Content": "Met in Sessions 30-31 with Gloriosa. Entourage including Sir Donovan, Thorn, Onyx, and blue-robed woman who prepared sleeping tonic. Support Gloriosa as prophet of Nyxara. Current status: Alive, traveling with Gloriosa.",
    "Related": ["CHAR-012", "EVENT-012", "EVENT-013"]
  },
  {
    "ID": "CHAR-060",
    "Type": "Organization",
    "Name": "House Stormrider",
    "Session": "16",
    "Content": "Never encountered as organization, represented by Lady Seriss. Noble house from Caeloria kingdom, rapid growth attracted The Gale's attention. Lady Seriss carries their signet ring. Mask was sent to infiltrate them originally. Current status: Active, Lady Seriss is member. Their rapid growth was the reason for The Gale's interest.",
    "Related": ["CHAR-001", "CHAR-006", "CHAR-025", "ITEM-001", "LOC-031", "EVENT-035", "QUEST-013"]
  },
  {
    "ID": "CHAR-061",
    "Type": "NPC",
    "Name": "Korr",
    "Session": "41",
    "Content": "Met in Session 41 during Ironhowl Forge theft attempt. Massive armored creature resembling a rhinoceros with muscular humanoid build (A Braxat). Mercenary working for Zrak'Torr, collapsed forge floor to access safe. Pragmatic and easily bribed, accepted 500 gold from Fauda to switch sides. Incredibly strong, hauled multi-hundred-pound safe back up from sewer. In Session 42, helped transport prisoners, explained he kills for money to provide for family but won't murder for free. Can be found at The Drowned Bell tavern or Bleeding Coin mercenary company HQ. In Session 45, immediately evacuated his family from Drifthold when warned about the Storm Lord threat, joining the party without charging for his services. Current status: Alive, traveling with wife Yedda and son Tarr, available for future hire.",
    "Related": ["CHAR-002", "CHAR-062", "CHAR-063", "CHAR-064", "CHAR-079", "CHAR-080", "ITEM-009", "LOC-005", "LOC-067", "EVENT-038", "EVENT-039", "QUEST-002"]
  },
  {
    "ID": "CHAR-062",
    "Type": "NPC",
    "Name": "Zrak'Torr",
    "Session": "41",
    "Content": "Met in Session 41 during Ironhowl Forge theft attempt. Strange kobold with third eye on forehead and eyestalks sprouting from body. Telekinetic abilities, pulled Shavara to safety and manipulated safe. Hired Korr for theft. Working for mysterious Beholder collecting special tools. In Session 42, was interrogated; revealed he was one of many Zrak'Torrs serving as right hand to Xyrx the Collector. Was purified of corruption at the Ever-Burning Temple by Lucan Brightmere. Current status: Alive, undergoing redemption at the Ever-Burning Temple.",
    "Related": ["CHAR-003", "CHAR-061", "CHAR-063", "CHAR-064", "CHAR-065", "ITEM-009", "LOC-005", "EVENT-038", "QUEST-002"]
  },
  {
    "ID": "CHAR-063",
    "Type": "NPC",
    "Name": "Earth Elemental",
    "Session": "41",
    "Content": "Met in Session 41 during Ironhowl Forge theft attempt. Elemental creature assisting theft team. Present during sewer confrontation but role unclear. Current status: Unknown, possibly defeated or escaped.",
    "Related": ["CHAR-061", "CHAR-062", "LOC-005", "EVENT-038"]
  },
  {
    "ID": "CHAR-064",
    "Type": "NPC",
    "Name": "Voraxik Valarnn (Updated)",
    "Session": "29",
    "Content": "Finally encountered directly in Session 41 during Ironhowl Forge theft. Young Dragonborn from Tempest's Watch who grew up with Vyphira. Shocked to see Vy, refused to strike her directly during fight. Revealed he, Shavara, and Kharzid were forced into thefts by a Beholder who caught them robbing its vault. The Beholder is collecting complete sets of special tools and threatened to kill them and possibly Vy's entire town if they refused. In Session 42, was interrogated and corroborated Shavara's story before being imprisoned for 'correction' by Edrin Locke. Current status: Soul imprisoned for correction, body in stasis.",
    "Related": ["CHAR-003", "CHAR-016", "CHAR-018", "CHAR-019", "CHAR-020", "CHAR-030", "CHAR-031", "CHAR-062", "CHAR-065", "ITEM-009", "LOC-004", "LOC-005", "LOC-034", "EVENT-015", "EVENT-038", "QUEST-002"]
  },
  {
    "ID": "CHAR-065",
    "Type": "NPC",
    "Name": "Xyrx the Collector",
    "Session": "42",
    "Content": "Never met directly, revealed by Voraxik and Shavara in Session 42. A powerful Beholder with a hidden underground lair and multiple magically connected vaults across Eryndor. Extremely paranoid. Unlike typical Beholders, adorns himself with jewelry and some form of armor or metallic plating. Caught Voraxik, Shavara, and Kharzid robbing a seaside vault near Tempest's Watch. Spared their lives in exchange for stealing special blacksmithing tools. Collecting complete sets of tools, claims tools were stolen from it long ago. So dangerous that speaking his name is believed to draw his attention. Current status: Alive, actively collecting tools. The mastermind behind the tool thefts.",
    "Related": ["CHAR-003", "CHAR-016", "CHAR-018", "CHAR-019", "CHAR-020", "CHAR-030", "CHAR-062", "CHAR-064", "ITEM-009", "QUEST-002"]
  },
  {
    "ID": "CHAR-066",
    "Type": "NPC",
    "Name": "Rory",
    "Session": "22",
    "Content": "Met in Session 22 along travel route when her ghost was revealed by Lantern of Revealing. Human female dancer, Arc's former best friend and dance partner. Died from illness/fever after overworking to save money for her boyfriend Jack. Ghost appears as sickly woman with Arc's face, missing legs in spectral form, bound by spectral chains to wrists. Personality: grateful, nostalgic, misses dancing. Currently bound to serve the Ghost King in afterlife after Jack's ghost dragged her into servitude. Encounter: revealed her binding, explained need to find Roseheart King's body in Virelka to potentially free enslaved spirits. Drew rose-heart sigil for party. Current status: Deceased, Ghost bound to Roseheart King.",
    "Related": ["CHAR-004", "CHAR-067", "CHAR-068", "LOC-061", "EVENT-039", "QUEST-014"]
  },
  {
    "ID": "CHAR-067",
    "Type": "NPC",
    "Name": "The Roseheart King",
    "Session": "22",
    "Content": "Never met directly, discussed by Lady Seriss and Edrin Locke. Infamous historical figure who ruled centuries ago from Virelka, most powerful kingdom in Eryndor at time. Legend: killed/executed all ten wives, bathed in blood, went mad, starved people before assassination. Became boogeyman figure warning children and brides. Ghost King bound to wander Eryndor by spell cast by ghosts of his murdered wives, tied to his mortal remains. Wears rose-at-heart-center sigil over heart where stabbed in betrayal. Current status: Deceased, Powerful ghost bound to wander, seeking return to body.",
    "Related": ["CHAR-004", "CHAR-006", "CHAR-066", "CHAR-068", "LOC-061", "EVENT-039", "QUEST-014"]
  },
  {
    "ID": "CHAR-068",
    "Type": "NPC",
    "Name": "Edrin Locke",
    "Session": "42",
    "Content": "Met in Session 42 at his private prison in Drifthold. Human male, Chainwright and Ghostspeaker, worshipper of Kelgriss. Speaks in whispery voice. Family has long served the dead. Runs supernatural prison service extracting souls into gems for 'correction' while bodies remain in stasis. Offers torment levels 1-10 priced at 50gp/month plus 25gp for correction. Knowledgeable about ghost lore, recognized Roseheart King's story. Offered Arc employment if she becomes a ghost. In Session 42, imprisoned Voraxik and Shavara for the party. Current status: Alive, operating prison business.",
    "Related": ["CHAR-004", "CHAR-018", "CHAR-020", "CHAR-062", "CHAR-066", "CHAR-067", "ITEM-009", "LOC-061", "EVENT-039", "QUEST-002", "QUEST-014"]
  },
  {
    "ID": "CHAR-069",
    "Type": "NPC",
    "Name": "Lyanna Vale",
    "Session": "42",
    "Content": "Met in Session 42 at Vales' keep in Drifthold. Half-elf, half-gnome daughter of Jorren Vale and elf mother from Solara. Appears trapped in gilded captivity, disappointed party wasn't there to kill her parents. Revealed she's a mage but not strong enough to overthrow parents alone. Willing to accept almost any fate to escape current situation. Mother's fate unknown. In Session 43, initially lied about being the sewer mage, then led the party to the real mage, Lucien Shinwell, revealing he is her uncle. Current status: Alive, captive in parents' keep, seeking escape to Solara.",
    "Related": ["CHAR-001", "CHAR-002", "CHAR-003", "CHAR-004", "CHAR-005", "CHAR-046", "CHAR-070", "CHAR-071", "CHAR-072", "LOC-026", "EVENT-040", "EVENT-041", "QUEST-015", "QUEST-016"]
  },
  {
    "ID": "CHAR-070",
    "Type": "NPC",
    "Name": "Jorren and Megara Vale",
    "Session": "42",
    "Content": "Met in Session 42 at their dining hall in Drifthold. Gnome mage twins controlling one of Drifthold's walking legs. Eccentric, unsettling, seated at opposite ends of enormous table. Came from Solara possibly as punishment, gathered army of orcs/goblins in nearby mountains, conquered their domain about 3 years ago. Plan to control every leg of Drifthold. In Session 42, assigned party tasks after blood pact completion: deal with sewer mage and kill Garrick Rathorn. Threatened party with grotesque experimentation. Current status: Alive, controlling leg of Drifthold.",
    "Related": ["CHAR-001", "CHAR-002", "CHAR-003", "CHAR-004", "CHAR-005", "CHAR-046", "CHAR-069", "CHAR-071", "LOC-008", "LOC-026", "EVENT-040", "QUEST-010", "QUEST-015"]
  },
  {
    "ID": "CHAR-071",
    "Type": "NPC",
    "Name": "Garrick Rathorn",
    "Session": "42",
    "Content": "Never met directly, discussed by Vales. Another leg mage of Drifthold, longest-tenured. Described by Vales as past his prime. Target of assassination plot so Lyanna Vale can take his domain. Current status: Alive, controlling leg of Drifthold.",
    "Related": ["CHAR-069", "CHAR-070", "LOC-008", "QUEST-015"]
  },
  {
    "ID": "CHAR-072",
    "Type": "NPC",
    "Name": "Lucien Shinwell",
    "Session": "43",
    "Content": "Met in Session 43 in a hidden chamber within the sewers beneath Vale Keep. A young man from the Shinwell Family of the Astral Order and Astral Academy, of mixed human and elf heritage. Well-dressed in fine clothes. Intelligent, determined, and stranded on Eryndor after his planar travel magic failed during his Planar Galavant. Revealed himself as Lyanna Vale's uncle, sent to rescue her and her mother Anorra (his sister) who is still trapped in Solara. Knowledgeable about cosmic lore, including the mythic Thunderwell Library and the giant Ormen the World-Breaker. Seeking a way back to Solara with Lyanna, with 'Rusty' Lou as a potential lead. Current status: Alive, allied with the party to reach Solara.",
    "Related": ["CHAR-069", "CHAR-073", "CHAR-075", "LOC-008", "LOC-062", "EVENT-041", "QUEST-015", "QUEST-016"]
  },
  {
    "ID": "CHAR-073",
    "Type": "NPC",
    "Name": "\"Rusty\" Lou",
    "Session": "44",
    "Content": "Met in Session 44 at The Cogwheel workshop. A stocky gnome (possibly half-gnome, half-dwarf) with soot-marked appearance. Brilliant but desperate inventor and teleportation specialist. Owes The Glint Syndicate 100,000 gold for Aetherglass purchased to help Zephara Moonveil return to Solara. Created a teleportation machine capable of reaching Solara, which he dismantled and packed into Bags of Holding for transport. Knowledgeable about Aetherglass sources in the Thundermaw Range. Currently has a Glint Syndicate debt mark burned into his arm for tracking. Current status: Alive, allied with the party, traveling with them to acquire Aetherglass and rebuild his machine.",
    "Related": ["CHAR-072", "CHAR-078", "ITEM-011", "LOC-063", "LOC-064", "EVENT-043", "QUEST-016", "QUEST-018"]
  },
  {
    "ID": "CHAR-074",
    "Type": "NPC",
    "Name": "Branthor the Thunderheart",
    "Session": "43",
    "Content": "Heard of in Session 43 through Lord Crimm's message. A giant who claims the title 'Storm Lord.' Has sent an emissary to Drifthold to declare dominion over the city, claiming his forces are already hidden within it. Negotiations are ongoing with the King of Drifthold. Current status: Alive, location unknown, threatening Drifthold.",
    "Related": ["CHAR-035", "EVENT-042", "QUEST-017"]
  },
  {
    "ID": "CHAR-075",
    "Type": "NPC",
    "Name": "Ormen the World-Breaker",
    "Session": "43",
    "Content": "Heard of in Session 43 from Lucien Shinwell. A powerful giant who laid claim to the city of Vortemark, north of Drifthold. Arrived with an army of storm-touched soldiers and, over two days, slaughtered and destroyed much of the city before declaring himself the 'Storm Lord' and ruler of the land. Wields powerful and mysterious storm magic himself. Considered extremely dangerous even by the powerful mage Shinwell. Current status: Alive, ruling Vortemark.",
    "Related": ["CHAR-072"]
  },
  {
    "ID": "CHAR-076",
    "Type": "NPC",
    "Name": "Lucan Brightmere",
    "Session": "42",
    "Content": "Met in Session 42 at The Ever-Burning Temple. The Radiant (High Priest) of the temple. Agreed to help with the party's prisoner Zrak'Torr. Performed a powerful purification ritual using Yondar's flame, drawing out and capturing a corrupting essence from Zrak'Torr, removing his extra eyestalks. Explained Yondar's teachings on redemption, that it does not exempt from punishment but extends to the eternal soul. Confirmed Zrak'Torr possessed a true soul. Current status: Alive, leading the Ever-Burning Temple and overseeing Zrak'Torr's redemption.",
    "Related": ["CHAR-026", "CHAR-062", "LOC-012", "EVENT-039"]
  },
  {
    "ID": "CHAR-077",
    "Type": "NPC",
    "Name": "Leon Gravix (\"Vix\")",
    "Session": "45",
    "Content": "Met in Session 45 at The Crackling Wand magic shop. Young man living under the alias 'Vix', working as an enchanter. Former researcher from Stormhaven who uncovered patterns in the storms. Carries dozens of notebooks detailing his research. Revealed the 51-year cycle of cataclysms that destroy Eryndor's advanced cities. Knowledgeable about historical artifacts like The Tempest's Prism and Yondar's Lantern. Warned the party about the imminent cataclysm, possibly manifesting as the war with Storm Lords. Current status: Alive, evacuated from Drifthold and traveling with the party.",
    "Related": ["ITEM-007", "ITEM-012", "LOC-065", "LOC-066", "EVENT-044", "QUEST-017", "QUEST-018"]
  },
  {
    "ID": "CHAR-078",
    "Type": "NPC",
    "Name": "Mikk \"Scab\" Snikk",
    "Session": "44",
    "Content": "Met in Session 44 at The Cogwheel. Well-dressed Skaven (ratfolk) debt collector for The Glint Syndicate, working for his brother and sister-in-law. Pragmatic and business-focused. Initially demanded payment for 'Rusty' Lou's debt, but negotiated with Fauda after learning about the Storm Lord threat to Drifthold. Allowed the party to take Lou in exchange for assuming responsibility for the debt. Burned the Glint Syndicate tracking mark into Lou's arm. Current status: Alive, managing Syndicate operations in Drifthold.",
    "Related": ["CHAR-073", "ITEM-011", "LOC-063", "EVENT-043"]
  },
  {
    "ID": "CHAR-079",
    "Type": "NPC",
    "Name": "Yedda",
    "Session": "45",
    "Content": "Mentioned in Session 45. Wife of Korr the Braxat. Evacuated from Drifthold with their son Tarr due to the Storm Lord threat. Traveling with the party for protection. Current status: Alive, traveling with the group.",
    "Related": ["CHAR-061"]
  },
  {
    "ID": "CHAR-080",
    "Type": "NPC",
    "Name": "Tarr",
    "Session": "45",
    "Content": "Mentioned in Session 45. Son of Korr and Yedda. Evacuated from Drifthold with his parents due to the Storm Lord threat. Traveling with the party for protection. Current status: Alive, traveling with the group.",
    "Related": ["CHAR-061", "CHAR-079"]
  },
{
    "ID": "CHAR-081",
    "Type": "NPC",
    "Name": "Calyx Newdusk",
    "Session": "46",
    "Content": "Met in Session 46 inside the magical bottle prison. A well-dressed, very large elf bounty hunter from Solara. Hovered above the battlefield to negotiate. Stated he was paid 8,000 gold by House Duskvale to capture and return the party, specifically believing Fauda to be Gloriosa. The bounty was issued because the party destroyed a gathering facility operated by House Honey, causing financial loss for powerful individuals. Open to negotiation as a mercenary but committed to his job. Notable capabilities include flight, charming magic, and use of magical imprisonment technology. Current status: Alive, in combat with the party inside the bottle prison.",
    "Related": ["CHAR-002", "CHAR-012", "CHAR-082"]
  },
  {
    "ID": "CHAR-082",
    "Type": "NPC",
    "Name": "Lloyd",
    "Session": "45",
    "Content": "First mentioned by name in Session 45, attendant of Cloudfoot Keep. Described as having an oiled and chiseled body, sunbathing on the keep's roof. Casual and familiar with the party, particularly Arc en Ciel with whom he spent private time. Knowledgeable about Solara's Bottle Kingdoms, identifying the mountain with a carved face from Lady Seriss's description as being located in one of them. In Session 46, he followed the party out of concern for Arc, was drawn into the magical bottle prison during the ambush, and was thrown into a mysterious black pyramid within the prison, from which he cannot exit. Current status: Alive, trapped inside the pyramid within the bottle prison.",
    "Related": ["CHAR-004", "CHAR-006", "CHAR-081"]
  }
]