[
  {
    "ID": "QUEST-001",
    "Type": "Quest",
    "Name": "Heal Mask's Fractured Mind",
    "Session": "25",
    "Content": "Status: Ongoing. Given by the party's collective concern, starting around Session 25. The goal is to find a cure for Mask's mental instability, confusion, and multiple personas. The party sought out Elandra Hallowheart in Tempest's Refuge for an initial diagnosis and patch. Later, Gloriosa performed a dangerous mindscape procedure to remove the parasitic persona Fendril. Mask has regained control, but the quest for complete mental stability and understanding continues, now tied to divine mysteries. Notable reward: Mask's sanity and the revelation of Fendril as a separate entity.",
    "Related": ["CHAR-001", "CHAR-007", "CHAR-012", "CHAR-022", "LOC-003", "LOC-009", "LOC-028", "EVENT-005", "EVENT-016", "QUEST-007"]
  },
  {
    "ID": "QUEST-002",
    "Type": "Quest",
    "Name": "Recover Vyphira's Stolen Tools and Armor",
    "Session": "29",
    "Content": "Status: In Progress. A personal quest for Vyphira. She discovered her stolen armor for sale in Session 29. The goal is to track down the thieves and recover her stolen craftsmanship and Sorrax Shieldweaver's family heirlooms. In Session 41, the party ambushed the thieves at Ironhowl Forge, capturing Voraxik and Shavara, and killing Kharzid. They recovered Torva Ironhowl's tool set and learned from Voraxik and Shavara that a powerful Beholder named Xyrx the Collector is forcing them to collect all existing sets of these tools. The immediate tools are secured, but the mastermind remains. Casualties: Kharzid Tazek (deceased). Reward: One set of tools recovered, information about the true mastermind.",
    "Related": ["CHAR-003", "CHAR-016", "CHAR-018", "CHAR-019", "CHAR-020", "CHAR-030", "CHAR-031", "CHAR-055", "CHAR-061", "CHAR-062", "CHAR-064", "CHAR-065", "CHAR-068", "ITEM-009", "LOC-004", "LOC-005", "LOC-027", "LOC-060", "LOC-061", "EVENT-015", "EVENT-018", "EVENT-038", "EVENT-039"]
  },
  {
    "ID": "QUEST-003",
    "Type": "Quest",
    "Name": "Journey to Tempest's Refuge",
    "Session": "26",
    "Content": "Status: Completed. Given by the party's need to find a healer for Mask. The goal was to travel from Cloudfoot Keep, through the Greenmurk Forest and plains, to reach the city of Tempest's Refuge. The journey included surviving an Imminent Convergence storm and a brutal encounter with cannibals. Notable reward: Reaching the city and accessing the healer Elandra Hallowheart. Casualties: Five cannibals.",
    "Related": ["CHAR-001", "CHAR-002", "CHAR-003", "CHAR-004", "CHAR-005", "CHAR-006", "LOC-001", "LOC-002", "LOC-006", "LOC-007", "EVENT-001", "EVENT-002", "EVENT-004"]
  },
  {
    "ID": "QUEST-004",
    "Type": "Quest",
    "Name": "Appease Azmir with a Worthy Hunt",
    "Session": "0",
    "Content": "Status: Ongoing. A personal quest for Sili, crystallized after the unworthy killing of Elandra in Session 27. The goal is to find and defeat a target deemed worthy by his god Azmir, to atone for the murder of an innocent. Sili has identified the slender man from The Gale as a potential target. Notable reward: Divine favor and personal redemption for Sili.",
    "Related": ["CHAR-005", "CHAR-008", "EVENT-006"]
  },
  {
    "ID": "QUEST-005",
    "Type": "Quest",
    "Name": "Rescue Lady Seriss from The Gale",
    "Session": "27",
    "Content": "Status: Ongoing. Forced upon the party by the slender Gale operative in Session 27. The goal was initially to find Flora Mourne to trade for Lady Seriss, but after Mask's betrayal of The Gale, it became a direct rescue mission. The party knows her location is unknown and that she is alive but captive.",
    "Related": ["CHAR-006", "CHAR-008", "CHAR-025", "EVENT-007", "EVENT-009", "EVENT-011"]
  },
  {
    "ID": "QUEST-006",
    "Type": "Quest",
    "Name": "Aid the Changeling Refugees",
    "Session": "28",
    "Content": "Status: Completed. Given by Flora Mourne and Veil after the party discovered their safe-house in Session 28. The goal was to help smuggle the changeling refugees, including the pregnant Veil and several children, out of Tempest's Refuge to safety in Drifthold. The party successfully deceived the city guards and escorted them to the road. Notable reward: The gratitude of the refugees and a step toward redemption for Elandra's murder.",
    "Related": ["CHAR-001", "CHAR-009", "CHAR-013", "CHAR-014", "CHAR-015", "LOC-003", "LOC-010", "LOC-025", "LOC-030", "EVENT-010", "EVENT-014"]
  },
  {
    "ID": "QUEST-007",
    "Type": "Quest",
    "Name": "Find Gloriosa's Missing Daughter, Faudana",
    "Session": "30",
    "Content": "Status: Ongoing. Personal quest for Gloriosa, adopted by Fauda and the party after their reunion in Session 30. The goal is to locate Faudana, who vanished at age twelve during a lunar ceremony and is believed to be connected to the goddess Nyxara. Gloriosa has dreams of her in a silver pool, similar to Mask's vision. The trail leads to Solara. Notable reward: Family reunion and potentially key information about Nyxara and Tana.",
    "Related": ["CHAR-002", "CHAR-012", "CHAR-033", "CHAR-048", "ITEM-008", "LOC-011", "EVENT-013", "EVENT-025", "QUEST-001"]
  },
  {
    "ID": "QUEST-008",
    "Type": "Quest",
    "Name": "Master Runic Theory",
    "Session": "40",
    "Content": "Status: Ongoing. A personal/side quest for the party, particularly Fauda, beginning around Session 40. The goal is to learn the art of runic magic from Drath Wordbinder. The party has begun studying with him, and Fauda has shown aptitude with the Wand of Air Glyphs. Notable reward: New magical capabilities and a deeper understanding of the world's magic system.",
    "Related": ["CHAR-002", "CHAR-015", "LOC-020", "LOC-030", "EVENT-029"]
  },
  {
    "ID": "QUEST-009",
    "Type": "Quest",
    "Name": "Find and Rescue Alira Crimm",
    "Session": "35-38",
    "Content": "Status: Completed. Given by Lord Halen Crimm in Session 35. The goal was to locate his missing daughter, ensure she had left willingly and safely, and convince her to return home. The party tracked her to a dragon cult, discovered she was a copper dragon, and rescued her from being sacrificed in a ritual. Notable reward: Draconic Boons, valuable items, and the favor of a powerful noble. Casualties: Seroth Kael, Brenna Kael, numerous dragon cultists.",
    "Related": ["CHAR-035", "CHAR-036", "CHAR-039", "CHAR-040", "CHAR-044", "ITEM-010", "LOC-013", "LOC-014", "LOC-015", "LOC-016", "EVENT-019", "EVENT-020", "EVENT-021", "EVENT-027", "EVENT-030"]
  },
  {
    "ID": "QUEST-010",
    "Type": "Quest",
    "Name": "Fulfill the Blood Pact with the Vale Mages",
    "Session": "30",
    "Content": "Status: Completed. Forced upon the party as a condition of entry into Drifthold in Session 30. The goal was to meet with Jorren and Megara Vale, which the party did in Session 42. The blood pact sigils faded after the meeting, indicating completion. However, the Vales then assigned new dangerous tasks. Notable reward: Freedom from blood pact obligations.",
    "Related": ["CHAR-046", "CHAR-069", "CHAR-070", "LOC-008", "LOC-026", "EVENT-012", "EVENT-040"]
  },
  {
    "ID": "QUEST-011",
    "Type": "Quest",
    "Name": "Seek Redemption from Yondar",
    "Session": "40",
    "Content": "Status: Ongoing. A quest for moral and spiritual redemption, primarily for Fauda, Vy, and Sili, after the murder of Elandra. Initiated through communication with the resurrected Elandra in Session 40. The goal is to complete three trials of righteousness set by Yondar to earn forgiveness. Notable reward: Atonement for their crime and restored standing with a major deity.",
    "Related": ["CHAR-002", "CHAR-003", "CHAR-005", "CHAR-007", "CHAR-026", "CHAR-027", "LOC-012", "EVENT-006", "EVENT-017", "QUEST-001"]
  },
  {
    "ID": "QUEST-012",
    "Type": "Quest",
    "Name": "Uncover the Truth About Tana and The Gale",
    "Session": "28",
    "Content": "Status: Ongoing. A core campaign-spanning quest driven by Mask's devotion to Tana and the party's conflict with The Gale, beginning around Session 28. The goal is to discover the truth behind Tana's shattering, the nature of The Gale and its connection to Solara, and the rumored divine offspring of Tana and Yondar. The party has learned that The Gale serves Solara and that changelings were created there. Notable reward: Understanding the central cosmic and political conflicts of the campaign.",
    "Related": ["CHAR-001", "CHAR-025", "CHAR-028", "CHAR-033", "CHAR-043", "CHAR-052", "ITEM-002", "ITEM-003", "ITEM-005", "ITEM-006", "ITEM-007", "LOC-011", "LOC-017", "EVENT-003", "EVENT-022", "EVENT-023", "QUEST-001", "QUEST-007"]
  },
  {
    "ID": "QUEST-013",
    "Type": "Quest",
    "Name": "Infiltrate House Stormrider (Original Gale Mission)",
    "Session": "0",
    "Content": "Status: Failed/Abandoned. Mask's original mission from The Gale, mentioned in backstory. The goal was to infiltrate the kingdom of Caeloria, ruled by House Stormrider, to discover the secret behind its rapid growth. Mask abandoned this mission after being struck by lightning and gaining magic, setting them on their current path. Notable reward: N/A - Mission was betrayed.",
    "Related": ["CHAR-001", "CHAR-006", "CHAR-025", "CHAR-060", "ITEM-001", "ITEM-004", "LOC-031", "EVENT-035"]
  },
  {
    "ID": "QUEST-014",
    "Type": "Quest",
    "Name": "Free Rory from Ghost King's Servitude",
    "Session": "22",
    "Content": "Status: Ongoing. Given by Rory's ghost in Session 22. The goal is to find the Roseheart King's body in ancient Virelka to unbind his ghost, which would free Rory and other enslaved spirits from eternal servitude. According to Edrin Locke, unbinding would send the king to eternal purgatory rather than resurrect him. Notable reward: Freedom for Rory's spirit and other bound ghosts.",
    "Related": ["CHAR-004", "CHAR-066", "CHAR-067", "CHAR-068", "LOC-061", "EVENT-039"]
  },
  {
    "ID": "QUEST-015",
    "Type": "Quest",
    "Name": "Deal with the Sewer Mage and Kill Garrick Rathorn",
    "Session": "42",
    "Content": "Status: Ongoing. Given by Jorren and Megara Vale in Session 42 after blood pact completion. The goal has two parts: stop a mage who has been sneaking through Vales' sewers freeing their 'pets', and assassinate Garrick Rathorn, another leg mage of Drifthold, so Lyanna Vale can take his domain. The Vales threatened the party with grotesque experimentation if they refuse. In Session 43, the party discovered the 'sewer mage' was actually Lucien Shinwell, Lyanna's uncle, and allied with him instead.",
    "Related": ["CHAR-046", "CHAR-069", "CHAR-070", "CHAR-071", "CHAR-072", "LOC-008", "LOC-026", "EVENT-040", "EVENT-041"]
  },
  {
    "ID": "QUEST-016",
    "Type": "Quest",
    "Name": "Reach Solara",
    "Session": "43",
    "Content": "Status: Ongoing. A new quest emerging from Session 43, shared by Lucien Shinwell and the party. The goal is to find a way to reach the floating city of Solara to rescue Lyanna Vale's mother Anorra, help Lucien return home, and potentially find information about Faudana and The Gale. The party has agreed to help Lucien find 'Rusty' Lou as a potential contact. Notable reward: Access to Solara, rescue of Anorra, advancement of multiple character goals.",
    "Related": ["CHAR-002", "CHAR-012", "CHAR-069", "CHAR-072", "CHAR-073", "ITEM-011", "LOC-011", "EVENT-041", "EVENT-043", "QUEST-007", "QUEST-012", "QUEST-015"]
  },
  {
    "ID": "QUEST-017",
    "Type": "Quest",
    "Name": "Defend Drifthold from Branthor the Thunderheart",
    "Session": "43",
    "Content": "Status: Ongoing. A new urgent quest emerging from Session 43. The goal is to defend the city of Drifthold from the giant Branthor the Thunderheart and his storm-touched forces, who have infiltrated the city and issued threats of dominion. The party is currently engaged in street combat against the initial wave of attackers. Notable reward: Survival of Drifthold and its inhabitants, favor of the city's leadership.",
    "Related": ["CHAR-001", "CHAR-002", "CHAR-003", "CHAR-004", "CHAR-005", "CHAR-035", "CHAR-074", "ITEM-007", "ITEM-012", "LOC-008", "EVENT-042", "EVENT-044"]
  },
  {
    "ID": "QUEST-018",
    "Type": "Quest",
    "Name": "Acquire Aetherglass",
    "Session": "44",
    "Content": "Status: Ongoing. A new quest emerging from Session 44. The goal is to travel to the Thundermaw Range to acquire Aetherglass for 'Rusty' Lou's teleportation machine. This substance is essential for reaching Solara and can be purchased from mountain tribes in the region. The party is currently traveling toward the Thundermaw Range with Cloudfoot Keep. Notable reward: Ability to power the teleportation machine to Solara.",
    "Related": ["CHAR-073", "CHAR-077", "ITEM-011", "ITEM-012", "LOC-001", "EVENT-043", "EVENT-044", "EVENT-045", "QUEST-016"]
  }
]