[
  {
    "ID": "CHAR-001",
    "Type": "PC",
    "Name": "Zara",
    "Session": "01",
    "Content": "Half-elf (Pallid Elf mother, infernal father). Pale elf features with an otherworldly presence. Daughter of the Pallid Elf king and queen; her half-brother is the current regent who sent her away. Her birth father is an entity of the Nine Hells. Personality is intense, protective, and prone to dark whispers and bloodlust. Her goal is to uncover her heritage and the mystery of her father. Wields a whispering bow that grants Hellish Rebuke and connects to a mysterious patron. A key combatant and tracker for the party.",
    "Related": ["CHAR-002", "CHAR-003", "CHAR-004", "CHAR-005", "CHAR-006", "CHAR-045", "CHAR-046", "LOC-001", "LOC-002", "LOC-012", "EVENT-001", "EVENT-004", "EVENT-008", "EVENT-009", "EVENT-010", "EVENT-011", "EVENT-013", "EVENT-016", "EVENT-017", "EVENT-019", "EVENT-020", "EVENT-023", "EVENT-025", "EVENT-026", "EVENT-027", "EVENT-030", "EVENT-032", "EVENT-033", "EVENT-034", "EVENT-035", "QUEST-001", "QUEST-004", "QUEST-010", "QUEST-015", "QUEST-017", "QUEST-020", "QUEST-026"]
  },
  {
    "ID": "CHAR-002",
    "Type": "PC",
    "Name": "Arya",
    "Session": "01",
    "Content": "Male Fairy Guardian. Stocky, muscular build with small, stubby wings, unlike typical fairies. A lumberjack who struggled for 60 years to form a binding contract. Observed personality is earnest, self-doubting, but ultimately self-accepting and hardworking. His goal was to find a charge; he is now bound to the party. Contributes in battle by shedding fairy dust to illuminate enemies and using his warhammer, Honeydrop, for battlefield control. Converts stamina from his charges into fairy dust for magic and equipment maintenance.",
    "Related": ["CHAR-007", "CHAR-008", "CHAR-009", "CHAR-022", "LOC-001", "EVENT-001", "EVENT-004", "EVENT-010", "EVENT-011", "EVENT-012", "EVENT-016", "EVENT-019", "EVENT-024", "EVENT-026", "EVENT-028", "EVENT-030", "EVENT-031", "EVENT-032", "EVENT-033", "QUEST-001", "QUEST-016", "QUEST-017", "QUEST-026"]
  },
  {
    "ID": "CHAR-003",
    "Type": "PC",
    "Name": "Fern",
    "Session": "01",
    "Content": "A druid connected to nature, possibly a plant-like being. Uses a magical pipe and is searching for Billy, a missing Treant. Observed as chill and connected to the natural world, but can be annoyed (e.g., by Arya during cooking). Contributes through druidic magic, communication with plants and animals, and combat support. His personal goal is to be reunited with his walking tree, Billy.",
    "Related": ["CHAR-010", "CHAR-011", "CHAR-048", "CHAR-049", "LOC-001", "LOC-003", "LOC-004", "LOC-006", "LOC-007", "LOC-008", "EVENT-001", "EVENT-003", "EVENT-004", "EVENT-005", "EVENT-006", "EVENT-007", "EVENT-008", "EVENT-010", "EVENT-011", "EVENT-016", "EVENT-018", "EVENT-019", "EVENT-021", "EVENT-022", "EVENT-024", "EVENT-028", "EVENT-030", "QUEST-001", "QUEST-002", "QUEST-010", "QUEST-017", "QUEST-020", "QUEST-026"]
  },
  {
    "ID": "CHAR-004",
    "Type": "PC",
    "Name": "Colm",
    "Session": "01",
    "Content": "A bounty hunter with a bounty on his head, accused of poisoning a competitor. Personality is proud, indifferent, and vengeful. His goal is to clear his name and find out who framed him for the murder. A formidable martial combatant. Avoids eye contact with Zara to prevent her from starting a massacre on his behalf.",
    "Related": ["CHAR-012", "CHAR-013", "CHAR-021", "CHAR-028", "CHAR-029", "CHAR-038", "CHAR-050", "CHAR-051", "LOC-001", "LOC-009", "LOC-015", "LOC-017", "LOC-018", "EVENT-001", "EVENT-004", "EVENT-008", "EVENT-009", "EVENT-010", "EVENT-011", "EVENT-015", "EVENT-016", "EVENT-019", "EVENT-020", "EVENT-024", "EVENT-025", "EVENT-030", "EVENT-031", "EVENT-032", "EVENT-035", "QUEST-001", "QUEST-004", "QUEST-017", "QUEST-020", "QUEST-025", "QUEST-026"]
  },
  {
    "ID": "CHAR-005",
    "Type": "PC",
    "Name": "Nira",
    "Session": "01",
    "Content": "A party member searching for a half-elven man named Rynn. She spent considerable time and money to find him. Her goal is to locate Rynn and understand what he is involved in. Contributes to the party's social and investigative efforts.",
    "Related": ["CHAR-014", "LOC-001", "LOC-008", "LOC-020", "EVENT-001", "EVENT-007", "EVENT-008", "EVENT-016", "EVENT-029", "EVENT-030", "QUEST-001", "QUEST-003", "QUEST-020"]
  },
  {
    "ID": "CHAR-006",
    "Type": "NPC",
    "Name": "Zara's Mother & Step-Father",
    "Session": "06",
    "Content": "Met through backstory. Pallid Elves, the king and queen of Sian'dorai. Both are currently missing. Their affiliation with Zara is as parents, but the relationship is complicated by her infernal heritage and her brother's regency.",
    "Related": ["CHAR-001", "CHAR-045", "LOC-002", "LOC-012", "EVENT-013", "EVENT-017", "QUEST-015"]
  },
  {
    "ID": "CHAR-007",
    "Type": "NPC",
    "Name": "Iryna",
    "Session": "01",
    "Content": "Met in backstory. A fairy, Arya's best friend, brought to life from a white lily. She is loyal but teases Arya. She is agile and has successfully formed a binding contract. Alive.",
    "Related": ["CHAR-002", "CHAR-022", "EVENT-012", "QUEST-016"]
  },
  {
    "ID": "CHAR-008",
    "Type": "NPC",
    "Name": "Lunimaraevanthorion Draelonar",
    "Session": "01",
    "Content": "Met in backstory. The strong, good, and fair elder of the Guardian fairy clan, appointed by Flora. He encourages Arya. Alive.",
    "Related": ["CHAR-002", "CHAR-022", "CHAR-044", "EVENT-012", "QUEST-016"]
  },
  {
    "ID": "CHAR-009",
    "Type": "NPC",
    "Name": "Brakka",
    "Session": "02",
    "Content": "Met in Session 02 in the Ogre camp. An Ogre, the wife of Gurruk (the Ogre killed in Session 01). She was angry but not at the party, and reaffirmed her husband was acting strangely. Alive.",
    "Related": ["CHAR-015", "CHAR-016", "CHAR-040", "LOC-003", "EVENT-002", "QUEST-010"]
  },
  {
    "ID": "CHAR-010",
    "Type": "NPC",
    "Name": "Billy",
    "Session": "02",
    "Content": "Met through backstory and found in Session 10. A Treant, Fern's missing walking tree. He went to investigate whispers of a rot. He is now the speaker for the sentient Hollow Spire (the party's Bastion). Alive and well.",
    "Related": ["CHAR-003", "CHAR-011", "CHAR-048", "CHAR-049", "LOC-003", "LOC-006", "LOC-007", "EVENT-003", "EVENT-007", "EVENT-021", "EVENT-022", "QUEST-002"]
  },
  {
    "ID": "CHAR-011",
    "Type": "NPC",
    "Name": "Myrtle",
    "Session": "02",
    "Content": "Met in Session 02 in her swamp hut. A druid. She provided information about the rot, Billy's whereabouts, and her sister, the Watcher of the Mire. Knowledgeable but practices druidism in a way that some (like Yarg) distrust. Alive.",
    "Related": ["CHAR-010", "CHAR-016", "CHAR-017", "LOC-003", "LOC-019", "EVENT-002", "EVENT-003", "EVENT-004", "QUEST-001", "QUEST-002", "QUEST-010"]
  },
  {
    "ID": "CHAR-012",
    "Type": "NPC",
    "Name": "Auntie Belba Mossfoot",
    "Session": "01",
    "Content": "Met in Session 01 after the Ogre attack. A gnomish woman, part of a merchant organization that runs Sunreach. Friendly and a quest-giver. Hired the party to investigate the vine attacks. Alive.",
    "Related": ["CHAR-023", "LOC-001", "EVENT-001", "EVENT-010", "QUEST-001", "QUEST-017"]
  },
  {
    "ID": "CHAR-013",
    "Type": "NPC",
    "Name": "Varyn Crowsblood",
    "Session": "08",
    "Content": "Mentioned in Session 08 via a wish. A noble who allegedly paid an armorer to poison Colm's weapon, framing him for murder. Status and location unknown.",
    "Related": ["CHAR-004", "CHAR-050", "EVENT-008", "EVENT-015", "QUEST-004"]
  },
  {
    "ID": "CHAR-014",
    "Type": "NPC",
    "Name": "Rynn",
    "Session": "14",
    "Content": "Met in Session 14 in Snagroot Village. A half-elven man Nira was searching for. An explorer who got stranded while on an adventure involving Bee Rexes. He was found alive and well.",
    "Related": ["CHAR-005", "CHAR-024", "LOC-008", "EVENT-007", "EVENT-008", "EVENT-029", "QUEST-003"]
  },
  {
    "ID": "CHAR-015",
    "Type": "NPC",
    "Name": "Gurruk",
    "Session": "01",
    "Content": "Met in Session 01. An Ogre who attacked the Sunreach festival. He was killed by the party and his body rotted rapidly. Deceased.",
    "Related": ["CHAR-009", "CHAR-040", "EVENT-001", "QUEST-001", "QUEST-010"]
  },
  {
    "ID": "CHAR-016",
    "Type": "NPC",
    "Name": "Yarg",
    "Session": "02",
    "Content": "Met in Session 02 in the Ogre camp. An Ogre wisewoman, Brakka's grandmother. Knowledgeable, knew Myrtle but distrusted her druidic practices. Gave the party warnings. Alive.",
    "Related": ["CHAR-009", "CHAR-011", "CHAR-040", "EVENT-002", "QUEST-010"]
  },
  {
    "ID": "CHAR-017",
    "Type": "NPC",
    "Name": "The Watcher of the Mire",
    "Session": "04",
    "Content": "Mentioned in Session 04. Myrtle's sister, who was taken by a hag and rescued, but now exists in a half-hag state. She is kept in the center of the swamp for safety. Her condition might be tied to the rot. Alive.",
    "Related": ["CHAR-011", "LOC-003", "QUEST-010"]
  },
  {
    "ID": "CHAR-018",
    "Type": "NPC",
    "Name": "Drowzel",
    "Session": "08",
    "Content": "Met in Session 08 at the wishing well in Petalmere. A Moon Bog Nixie bound to a wishing well. Grants wishes in exchange for secrets or by tossing a silver coin. Alive.",
    "Related": ["LOC-005", "EVENT-008", "QUEST-020"]
  },
  {
    "ID": "CHAR-019",
    "Type": "NPC",
    "Name": "Mawmaw Roux",
    "Session": "10",
    "Content": "Met in Session 10 in Mudwater Bend. An elderly figure, 'everybody's grandma.' Informed the party about Billy's disappearance into the Hollow Spire. Gave them the Bullywug quest. Alive.",
    "Related": ["CHAR-037", "LOC-006", "EVENT-007", "QUEST-002", "QUEST-005", "QUEST-018", "QUEST-019"]
  },
  {
    "ID": "CHAR-020",
    "Type": "NPC",
    "Name": "Barkle",
    "Session": "10",
    "Content": "Met in Session 10. A cute dog that delivered the Moss Key to the party, allowing access to their Bastion (Hollow Spire). Acts as a messenger between the party and the Bastion. Alive.",
    "Related": ["LOC-007", "EVENT-007", "EVENT-021"]
  },
  {
    "ID": "CHAR-021",
    "Type": "NPC",
    "Name": "Elder Marrin Broadshoulder",
    "Session": "27",
    "Content": "Met in Session 27 in Stonehaven Shores. An elderly Goliath, the record keeper of the town. Provided Colm with crucial information about the amended tournament records and the sighting of Tyber after the event. Alive.",
    "Related": ["CHAR-004", "CHAR-027", "CHAR-028", "CHAR-029", "CHAR-030", "CHAR-038", "LOC-009", "EVENT-009", "EVENT-015", "QUEST-004", "QUEST-013", "QUEST-014", "QUEST-022", "QUEST-023"]
  },
  {
    "ID": "CHAR-022",
    "Type": "Organization",
    "Name": "Arya's Fairy Clan",
    "Session": "01",
    "Content": "A clan of Guardian Fairies, led by Elder Lunimaraevanthorion. Their purpose is to form binding contracts with intelligent beings to convert stamina into fairy dust. The party encountered them through Arya's backstory. Key interaction is Arya finally forming a contract with the party. The relationship is positive, with Arya sending most of his fairy dust back to the clan.",
    "Related": ["CHAR-002", "CHAR-007", "CHAR-008", "CHAR-044", "EVENT-012", "QUEST-016"]
  },
  {
    "ID": "CHAR-023",
    "Type": "Organization",
    "Name": "Belba's Merchant Organization",
    "Session": "01",
    "Content": "A merchant organization that runs Sunreach. Purpose is trade and city governance. Headquarters is Sunreach. The party encountered them through Auntie Belba Mossfoot. Key interactions: hiring the party for initial investigations and providing information and rewards. Current relationship is positive and professional.",
    "Related": ["CHAR-012", "LOC-001", "QUEST-001"]
  },
  {
    "ID": "CHAR-024",
    "Type": "Organization",
    "Name": "Wildrunner Clan",
    "Session": "11",
    "Content": "A clan of Halfling Bee-Rex herders in Drak'Moru. Their purpose is to care for and breed Bee Rexes. Headquarters is Snagroot Village. The party encountered them while delivering a barrel for Brack and later helping with the Emberfang kobold problem. Key interactions: rewarding the party for rescuing Bee Rexes and providing information. Current relationship is very positive.",
    "Related": ["CHAR-014", "CHAR-032", "CHAR-033", "CHAR-043", "LOC-008", "EVENT-007", "EVENT-014", "QUEST-003", "QUEST-006", "QUEST-009", "QUEST-011", "QUEST-021", "QUEST-028"]
  },
  {
    "ID": "CHAR-025",
    "Type": "Organization",
    "Name": "Emberfang Kobolds",
    "Session": "15",
    "Content": "A tribe of fire-loving kobolds raiding the Wildrunner clan. Their main camp was 'The Nest.' The party encountered them in Sessions 15-18. Key interactions: the party attacked and cleared their outposts and main camp, freeing captured Bee Rexes. The organization was largely eradicated by the party.",
    "Related": ["LOC-008", "LOC-014", "EVENT-007", "QUEST-006", "QUEST-011"]
  },
  {
    "ID": "CHAR-026",
    "Type": "PC",
    "Name": "Brynd",
    "Session": "20",
    "Content": "Met in Session 20. Philosophical and reckless. He wondered about the souls of snakes and goblins, then attempted to build resistance to snake venom by swallowing it, resulting in violent illness. Uses ki energy. Has developed a habit of using himself as bait to taunt and attract sea creatures in hopes of a fresh seafood meal, a tactic that has successfully lured in threats like weresharks but often with unintended consequences.",
    "Related": ["CHAR-001", "CHAR-002", "CHAR-003", "CHAR-004", "CHAR-052", "LOC-009", "LOC-017", "EVENT-009", "EVENT-023", "EVENT-024", "EVENT-025", "EVENT-031", "EVENT-033", "QUEST-024", "QUEST-026"]
  },
  {
    "ID": "CHAR-027",
    "Type": "NPC",
    "Name": "Valdrek Tidewatcher",
    "Session": "27",
    "Content": "Mentioned in Session 27. The village leader of Stonehaven Shores. A Goliath. The party did not directly meet him, opting to see the record keeper instead. Alive.",
    "Related": ["CHAR-021", "LOC-009"]
  },
  {
    "ID": "CHAR-028",
    "Type": "NPC",
    "Name": "Tyber",
    "Session": "27",
    "Content": "Mentioned in Session 27 through tournament records. The man Colm was accused of poisoning during the Royal Summit Tournament. Records indicate he was sighted alive in multiple locations after the tournament, proving Colm was framed. Status: Alive.",
    "Related": ["CHAR-004", "CHAR-021", "EVENT-009", "EVENT-015", "QUEST-004"]
  },
  {
    "ID": "CHAR-029",
    "Type": "NPC",
    "Name": "Noa Youtil",
    "Session": "27",
    "Content": "Mentioned in Session 27 through tournament records. A duelist of the High Glacier who was a participant in the tournament. Colm now believes she being the grand daughter of the former king of Itinit - King Yout, may be the real target of the conspirators. Status: Alive, potentially in danger.",
    "Related": ["CHAR-004", "CHAR-021", "LOC-015", "EVENT-009", "EVENT-015", "QUEST-004", "QUEST-025"]
  },
  {
    "ID": "CHAR-030",
    "Type": "NPC",
    "Name": "Tom Bouldertstep",
    "Session": "27",
    "Content": "Mentioned in Session 27. A storyteller from Stonehaven Shores who wandered off. His walking stick washed up on shore, leading the town to believe he was dead. He later returned to town naked and confused. Alive.",
    "Related": ["CHAR-021", "LOC-009", "QUEST-014"]
  },
  {
    "ID": "CHAR-031",
    "Type": "NPC",
    "Name": "Sage Splup the Slime",
    "Session": "10",
    "Content": "Met in Session 10. The leader of the Bullywugs at the Hollow Pools. Claimed the land as their own. Killed by the party during the encounter. Deceased.",
    "Related": ["LOC-010", "QUEST-005"]
  },
  {
    "ID": "CHAR-032",
    "Type": "NPC",
    "Name": "Branver Emberbrush",
    "Session": "14",
    "Content": "Met in Session 14. The elder of the larger Wildrunner outpost. Asked the party to investigate the missing food and tools, suspecting Leshy mischief. Alive.",
    "Related": ["CHAR-024", "CHAR-033", "LOC-008", "EVENT-007", "QUEST-006", "QUEST-021"]
  },
  {
    "ID": "CHAR-033",
    "Type": "NPC",
    "Name": "Murmura",
    "Session": "14",
    "Content": "Met in Session 14. A Leshy the party encountered while investigating missing supplies. Explained they used the piles of food and tools to ward off 'the change' (the moon rot) and left rare herbs in return. Gave the party a pouch of medicinal herbs. Alive.",
    "Related": ["CHAR-024", "CHAR-032", "EVENT-007", "QUEST-006", "QUEST-010", "QUEST-021"]
  },
  {
    "ID": "CHAR-034",
    "Type": "NPC",
    "Name": "Chester",
    "Session": "08",
    "Content": "Met in Session 08 in a glade on the way to Petalmere. A curious, whimsical Fey creature who describes himself as a 'whimsical inconvenience.' He led the party through 'the Spirals' by posing three riddles and guiding them in a spiral dance. Gave the party a silver coin that reveals hidden paths in the moonlight. Playful and enigmatic. Alive.",
    "Related": ["LOC-011", "EVENT-005"]
  },
  {
    "ID": "CHAR-035",
    "Type": "NPC",
    "Name": "Elder Myla",
    "Session": "08",
    "Content": "Met in Session 08 in Petalmere. The human elder of the village. Her grandmother was the last Bloom-Keeper for the Ash Thorn Court. She tasked the party with finding Tamson, a girl who went missing in the wildflower fields. Initially reluctant to accept the Fey bargain's terms, she ultimately saw the wisdom in the party's handling of the situation after they provided proof. Alive.",
    "Related": ["CHAR-036", "CHAR-047", "LOC-005", "EVENT-006", "QUEST-007", "QUEST-012"]
  },
  {
    "ID": "CHAR-036",
    "Type": "NPC",
    "Name": "Tamson",
    "Session": "08",
    "Content": "Met in Session 08 in the Feywild. A human girl from Petalmere with a special connection to flowers. She went out picking in the wildflower fields and was taken by the Ash Thorn Court, as per the ancient bargain. She loves it in the Feywild and did not want to return home. Alive.",
    "Related": ["CHAR-035", "CHAR-047", "LOC-005", "LOC-013", "EVENT-006", "QUEST-007", "QUEST-012"]
  },
  {
    "ID": "CHAR-037",
    "Type": "NPC",
    "Name": "Joonie",
    "Session": "10",
    "Content": "Met in Session 10 in Mudwater Bend. A local who provided information to the party. Told them that something was 'definitely off' with the Hollow Spire tree and that it felt like it was 'alive again.' Also identified the howl they heard as belonging to a Rougarou, not a wolf. Alive.",
    "Related": ["CHAR-019", "LOC-006", "LOC-007", "QUEST-002", "QUEST-018", "QUEST-019"]
  },
  {
    "ID": "CHAR-038",
    "Type": "NPC",
    "Name": "Aeowen Fidl",
    "Session": "27",
    "Content": "Mentioned in Session 27 in the tournament records from Stonehaven Shores. Captain of the Frostguard and a participant in the Royal Summit Tournament where Colm was framed. Status and current location unknown.",
    "Related": ["CHAR-004", "CHAR-021", "EVENT-009", "EVENT-015", "QUEST-004"]
  },
  {
    "ID": "CHAR-039",
    "Type": "NPC",
    "Name": "Olena",
    "Session": "01",
    "Content": "Mentioned in Arya's backstory. A young fairy (age 35) who formed a binding contract with a young lad who used her drinking straw. Her ceremony made Arya envious. Alive.",
    "Related": ["CHAR-002"]
  },
  {
    "ID": "CHAR-040",
    "Type": "NPC",
    "Name": "Rukk",
    "Session": "02",
    "Content": "Met in Session 02. An Ogre, Gurruk's brother, who was looking for his missing brother. Asked the party to tell Brakka about Gurruk's fate. Alive.",
    "Related": ["CHAR-009", "CHAR-015", "CHAR-016", "EVENT-002"]
  },
  {
    "ID": "CHAR-041",
    "Type": "NPC",
    "Name": "Bryn Ashwell",
    "Session": "06",
    "Content": "Met in Session 06 in Emberfell. The innkeeper who gave the party rooms. Alive.",
    "Related": ["LOC-004", "EVENT-018"]
  },
  {
    "ID": "CHAR-042",
    "Type": "NPC",
    "Name": "Maeven Thornholt",
    "Session": "07",
    "Content": "Met in Session 07. A farmer in Emberfell whose sheep were acting strangely due to the mysterious stone on their property. Paid the party 100 gp for removing the stone. Alive.",
    "Related": ["LOC-004", "EVENT-011", "QUEST-008", "QUEST-027", "ITEM-001"]
  },
  {
    "ID": "CHAR-043",
    "Type": "NPC",
    "Name": "Brack",
    "Session": "11",
    "Content": "Mentioned in Session 11. A brewmaster who hired the party to deliver a barrel to the Wildrunner clan for 100 gp and a bag of holding. Alive.",
    "Related": ["CHAR-024", "EVENT-007", "EVENT-014", "QUEST-009"]
  },
  {
    "ID": "CHAR-044",
    "Type": "NPC",
    "Name": "Flora",
    "Session": "01",
    "Content": "Mentioned in Arya's backstory. The spring goddess who transforms her favorite flowers into fairies and sends them to different clans. Deity status.",
    "Related": ["CHAR-002", "CHAR-008", "CHAR-022"]
  },
  {
    "ID": "CHAR-045",
    "Type": "NPC",
    "Name": "Zara's Half-Brother",
    "Session": "06",
    "Content": "Mentioned in Session 06. The current regent of Sian'dorai who sent Zara away to 'find someone more useful' while their parents are missing. Relationship with Zara is strained.",
    "Related": ["CHAR-001", "CHAR-006", "LOC-002", "EVENT-017", "QUEST-015"]
  },
  {
    "ID": "CHAR-046",
    "Type": "NPC",
    "Name": "Zara's Infernal Father",
    "Session": "08",
    "Content": "Mentioned in backstory. An entity of the Nine Hells who is Zara's birth father. One of the central mysteries of her character. Has a gateway into Sian'dorai. Status and location unknown.",
    "Related": ["CHAR-001", "LOC-002", "EVENT-008", "EVENT-013", "QUEST-010", "QUEST-015"]
  },
  {
    "ID": "CHAR-047",
    "Type": "Organization",
    "Name": "Ash Thorn Court",
    "Session": "08",
    "Content": "Mentioned in Session 08. A Fey court that made a bargain with the settlers of Petalmere. In return for protection and bounty, the village maintained a Bloom-Keeper and every generation one person from the bloodline is taken (but not killed). The party encountered them when investigating Tamson's disappearance and entered their realm in the Feywild.",
    "Related": ["CHAR-035", "CHAR-036", "LOC-005", "LOC-013", "EVENT-006", "QUEST-007", "QUEST-012"]
  },
  {
    "ID": "CHAR-048",
    "Type": "NPC",
    "Name": "The Hollow Spire (Tree)",
    "Session": "10",
    "Content": "Met in Session 10. A sentient, dormant tree in Mudwater Bend that awakened and took Billy as its speaker. It told the party it had been alone for too long and needed a purpose. Now serves as the party's Bastion (extradimensional base). The tree itself is a character with consciousness.",
    "Related": ["CHAR-003", "CHAR-010", "CHAR-020", "CHAR-037", "LOC-007", "EVENT-007", "EVENT-021"]
  },
  {
    "ID": "CHAR-049",
    "Type": "NPC",
    "Name": "Fern's Family",
    "Session": "18",
    "Content": "Met in Session 18. A group of walking trees (like Billy and Fern) who had been searching for Billy and finally found Fern. After learning Billy was on his own path, they returned to their forest with Fern guiding them.",
    "Related": ["CHAR-003", "CHAR-010", "EVENT-007", "EVENT-022", "QUEST-002"]
  },
  {
    "ID": "CHAR-050",
    "Type": "NPC",
    "Name": "The Armorer",
    "Session": "08",
    "Content": "Mentioned in Session 08 via Drowzel's vision. The person who actually poisoned Colm's weapon, paid by Varyn Crowsblood. Status and location unknown.",
    "Related": ["CHAR-004", "CHAR-013", "EVENT-008", "EVENT-015", "QUEST-004"]
  },
  {
    "ID": "CHAR-051",
    "Type": "NPC",
    "Name": "The Hooded Figure",
    "Session": "27",
    "Content": "Mentioned in Session 27 in Colm's recurring dream. A hooded figure standing beside a silver and blue banner with an emblazoned crown and twisting vine, near a ruined watchtower half-buried in snow. Identity unknown, but likely connected to the conspiracy against Colm.",
    "Related": ["CHAR-004", "EVENT-009", "EVENT-015", "QUEST-004"]
  },
  {
    "ID": "CHAR-052",
    "Type": "PC",
    "Name": "Azren",
    "Session": "20",
    "Content": "A 26-year-old Aasimar and an Oath of Glory Paladin (following Devotion tenets) of The Radiant Coil. He is currently in temporary exile from his order for executing a captive warlord in a fit of rigid, uncompromising justice. He was raised in the floating sanctuary of Xotalan and is one of the youngest ever to achieve knighthood. Skilled with throwing knives, he seeks to understand the balance between violence and peace. For each conflict, he collects a feather: bright if resolved peacefully, white if violence was the only option, and dark if violence was used unnecessarily. His mother is a member of the order. He seeks redemption to eventually return home. In Session 28, he delivered the final, radiant blow that destroyed the moon-touched undead leader in the crypt.",
    "Related": ["CHAR-053", "CHAR-054", "LOC-021", "EVENT-031", "EVENT-032", "EVENT-033", "EVENT-034", "EVENT-035", "QUEST-013"]
  },
  {
    "ID": "CHAR-053",
    "Type": "Organization",
    "Name": "The Radiant Coil",
    "Session": "20",
    "Content": "A small order of paladins (~50 members) led by the ancient couatl Nual'Zahiir, based in the floating sanctuary of Xotalan in Drak'Moru. Their creed is 'Violence is a last resort, yet a tool not to be shunned.' They act as mediators and problem-solvers, trained in diplomacy but swift in justice when needed. Their heraldry is an Ouroboros made of opal. Passage to their temple is a trial to prove one's purity of intent.",
    "Related": ["CHAR-052", "CHAR-054", "LOC-021"]
  },
  {
    "ID": "CHAR-054",
    "Type": "NPC",
    "Name": "Nual'Zahiir",
    "Session": "20",
    "Content": "An ancient couatl, the serene and sorrowful leader of The Radiant Coil. It was Nual'Zahiir who pronounced Azren's temporary exile, tasking him to learn the balance between sword and soul. It speaks with soft, echoing authority.",
    "Related": ["CHAR-052", "CHAR-053", "LOC-021"]
  },
  {
    "ID": "CHAR-055",
    "Type": "NPC",
    "Name": "Captain Kixxaez",
    "Session": "29",
    "Content": "The pink-scaled Lizardfolk captain of a fishing trawler. A formidable and respected leader, skilled in sailing and combat. Known for her prowess in shipboard games, easily outmatching her passengers. Hired by the party for their sea voyage.",
    "Related": ["CHAR-001", "CHAR-002", "CHAR-026", "CHAR-052", "CHAR-056", "LOC-022", "EVENT-033", "EVENT-034"]
  },
  {
    "ID": "CHAR-056",
    "Type": "Organization",
    "Name": "Kixxaez's Lizardfolk Crew",
    "Session": "29",
    "Content": "The capable and hardy Lizardfolk crew of Captain Kixxaez's trawler. Skilled sailors and fishermen, they perform rituals for safe voyages and respect strength and skill. Their morale is high, and they cheered for Arya's contest win.",
    "Related": ["CHAR-055", "LOC-022", "EVENT-033"]
  },
  {
    "ID": "CHAR-057",
    "Type": "NPC",
    "Name": "Neressa",
    "Session": "30",
    "Content": "Leader of Myral's Guard, a group of Tritons. A friend of Captain Kixxaez. She boarded the ship to beg for aid, explaining that a humming crystal shard is poisoning the sea, twisting the tides, and turning their guardians against them.",
    "Related": ["CHAR-055", "CHAR-058", "LOC-023", "EVENT-035", "QUEST-029"]
  },
  {
    "ID": "CHAR-058",
    "Type": "Organization",
    "Name": "Myral's Guard (Tritons)",
    "Session": "30",
    "Content": "A group of Tritons from below Zepharok, led by Neressa. Their home is being destroyed by a mysterious crystal shard's corruption. They sought out surface dwellers for help, as they are immune to the shard's call.",
    "Related": ["CHAR-057", "LOC-023", "EVENT-035", "QUEST-029"]
  }
]