[
  {
    "ID": "LOC-001",
    "Type": "Location",
    "Name": "Sunreach",
    "Content": "A city on Solvaris. Hosts the Sunreach Midsummer Festival. Controlled by a council and a merchant organization. Points of interest: The Gilded Ladle inn (run by Aunti Belba), festival grounds, various competition tents. Key characters: Aunti Belba Mossfoot, the party. The party started here, fought a blighted Ogre, received their first quest, and returned multiple times to report and enjoy the festival.",
    "Related": ["CHAR-001", "CHAR-002", "CHAR-003", "CHAR-004", "CHAR-005", "CHAR-006", "CHAR-011", "CHAR-023", "EVENT-001", "EVENT-005", "QUEST-001", "QUEST-002"]
  },
  {
    "ID": "LOC-002",
    "Type": "Location",
    "Name": "The Gilded Ladle",
    "Content": "An inn in Sunreach run by Aunti Belba Mossfoot. Served as the party's free lodging during the festival and a meeting place for quests. A private room was used for discussions with Belba. The party stayed here multiple times.",
    "Related": ["CHAR-001", "CHAR-002", "CHAR-003", "CHAR-004", "CHAR-005", "CHAR-006", "LOC-001", "EVENT-001"]
  },
  {
    "ID": "LOC-003",
    "Type": "Location",
    "Name": "Myrtle's Hut",
    "Content": "A hut located in a swamp near Sunreach. Home of the druid Myrtle. A key location for information about the rot and the blighted Ogres. The party visited multiple times to deliver items, get information, and receive new objectives.",
    "Related": ["CHAR-003", "CHAR-008", "CHAR-009", "CHAR-010", "EVENT-002", "EVENT-003", "EVENT-004", "QUEST-001", "QUEST-002"]
  },
  {
    "ID": "LOC-004",
    "Type": "Location",
    "Name": "Ogre Camp",
    "Content": "A camp in the hills near the swamp. Home to Gurruk's clan, including his wife Brakka, brother Rukk, and wisewoman Yarg. The party visited to deliver the news of Gurruk's death and gained allies and information about the rot.",
    "Related": ["CHAR-010", "CHAR-011", "CHAR-012", "EVENT-002"]
  },
  {
    "ID": "LOC-005",
    "Type": "Location",
    "Name": "Mudwater Bend / The Hollow Spire",
    "Content": "A town in Drak'Moru. Points of interest: Mawmaw Roux's home, the Hollow Spire (a sentient, dormant tree that became the party's Bastion). Key characters: Mawmaw Roux, Joonie, Barkle, Billy. The party found Billy here, cleared a Bullywug problem at the Hollow Pools, and gained their own extradimensional base.",
    "Related": ["CHAR-003", "CHAR-009", "CHAR-016", "CHAR-017", "CHAR-018", "EVENT-008", "QUEST-003", "QUEST-004"]
  },
  {
    "ID": "LOC-006",
    "Type": "Location",
    "Name": "Petalmere",
    "Content": "A village connected to the Feywild. Points of interest: Elder Myla's cottage, the wildflower fields, the wishing well. Key characters: Elder Myla, Tamson, Drowzel. The party investigated missing gatherers, learned of the ancient fey bargain, and had their fortunes told at the well.",
    "Related": ["CHAR-005", "CHAR-014", "CHAR-015", "CHAR-019", "CHAR-024", "EVENT-007", "EVENT-008", "QUEST-002"]
  },
  {
    "ID": "LOC-007",
    "Type": "Location",
    "Name": "Emberfell",
    "Content": "An old, small town. Points of interest: The inn run by Bryn Ashwell, the 'Singing Tree' (which hid a sinkhole to a mushroom cavern). The party investigated the Mysterious Stone here, descending into the caverns beneath the tree.",
    "Related": ["CHAR-001", "CHAR-002", "CHAR-003", "CHAR-004", "EVENT-006", "QUEST-002"]
  },
  {
    "ID": "LOC-008",
    "Type": "Location",
    "Name": "Maeven's Farm",
    "Content": "A farm near Emberfell where a mysterious lunar stone landed in a crater. Sheep here were acting strangely, chanting about the moon. The party found the stone and discovered a tunnel leading to an ancient celestial binding point.",
    "Related": ["EVENT-007", "QUEST-002"]
  },
  {
    "ID": "LOC-009",
    "Type": "Location",
    "Name": "Snagroot Village",
    "Content": "The main settlement of the Wildrunner halflings in Drak'Moru. A base for Bee Rex herders. The party stayed here, cooked Raptor stew, met Rynn, and received the quest to deal with the Emberfang kobolds.",
    "Related": ["CHAR-003", "CHAR-007", "CHAR-014", "CHAR-025", "EVENT-014", "EVENT-015", "QUEST-005", "QUEST-006"]
  },
  {
    "ID": "LOC-010",
    "Type": "Location",
    "Name": "The Nest",
    "Content": "The main underground encampment of the Emberfang kobolds. A complex of caves containing imprisoned Wildrunners, stolen Bee Rexes, and a half-red dragon Indominus Rex. The party cleared this location, freeing prisoners and defeating the leaders.",
    "Related": ["CHAR-025", "CHAR-026", "EVENT-015", "QUEST-006"]
  },
  {
    "ID": "LOC-011",
    "Type": "Location",
    "Name": "The Spirals",
    "Content": "A mysterious, fey-touched region of shifting paths and glades. The party met Chester here, solved his riddles, performed a spiral dance, and were gifted a coin that reveals hidden paths, saving them two days of travel.",
    "Related": ["CHAR-013", "EVENT-007"]
  },
  {
    "ID": "LOC-012",
    "Type": "Location",
    "Name": "The Sunken Verge",
    "Content": "A perpetually damp part of the swamp. Myrtle sent the party here to find the body of the Echo Wraith. They found an abandoned campsite, fought zombies and vines, and discovered a map of lunar fault lines and a dream journal.",
    "Related": ["CHAR-008", "EVENT-004", "QUEST-002"]
  },
  {
  "ID": "LOC-013",
  "Type": "Location",
  "Name": "Sian'dorai",
  "Content": "The hidden kingdom of the Pallid Elves, carved deep beneath the Starsong Hills. The city is a marvel of elven architecture, with glowing quartz-and-crystal spires illuminated by enchanted braziers that create an eternal, starry twilight. Zara was raised here by her mother and step-father, the ruling Pallid Elf monarchs. The kingdom holds a dark secret: a gateway to the Nine Hells exists within its depths, which is tied to the mystery of Zara's birth father.",
  "Related": ["CHAR-001", "CHAR-029"]
  }
]
