[
  {
    "ID": "QUEST-001",
    "Type": "Quest",
    "Name": "Investigate the Rot & Find Rynn",
    "Content": "Status: Partially Complete (Rynn Found, Rot Investigation Ongoing). Given by Aunti Belba Mossfoot in Session 1, with the initial goal of investigating strange vine attacks and finding Myrtle. The goal expanded to understanding the lunar rot and finding Nira's friend, Rynn. Rynn was found alive in Snagroot Village (Session 14). The larger investigation into the source and nature of the rot is ongoing. Notable reward: 200 gp initially, with future work promised.",
    "Related": ["CHAR-005", "CHAR-006", "CHAR-007", "CHAR-008", "EVENT-001", "EVENT-003", "EVENT-013"]
  },
  {
    "ID": "QUEST-002",
    "Type": "Quest",
    "Name": "Myrtle's Investigations",
    "Content": "Status: Ongoing. A series of tasks given by Myrtle the druid starting in Session 2. Goals included: retrieve a Lunar Widow's Bloom (done), investigate the Sunken Verge (done, found lunar fault line map), and find more evidence of the rot. The party has acted as messengers between Myrtle and Aunti Belba. Notable rewards: 200 gp from Belba for initial report, plus an additional 50 gp for returning to Myrtle.",
    "Related": ["CHAR-006", "CHAR-008", "EVENT-003", "EVENT-004", "EVENT-007", "EVENT-008"]
  },
  {
    "ID": "QUEST-003",
    "Type": "Quest",
    "Name": "Find Billy the Treant",
    "Content": "Status: Complete. Fern's personal quest, initiated before Session 1. The goal was to find the missing walking tree. Billy was found in the Hollow Spire in Mudwater Bend (Session 10), now acting as the voice for the sentient tree/Bastion. He is safe and on his own path. Notable reward: Reunion with Billy and the acquisition of the party's Bastion.",
    "Related": ["CHAR-003", "CHAR-008", "CHAR-009", "EVENT-003", "EVENT-009"]
  },
  {
    "ID": "QUEST-004",
    "Type": "Quest",
    "Name": "Deal with the Bullywugs",
    "Content": "Status: Complete. Given by Mawmaw Roux in Session 10 in Mudwater Bend. The goal was to clear the Bullywug threat from the Hollow Pools. The party killed the Bullywug leader, Sage Splup, and an attracted Gatorougarou. Notable casualties: Sage Splup and his Bullywugs, the Gatorougarou. Notable reward: Payment and gratitude from Mawmaw Roux.",
    "Related": ["CHAR-016", "CHAR-017", "EVENT-010"]
  },
  {
    "ID": "QUEST-005",
    "Type": "Quest",
    "Name": "Supply Transport to the Wildrunners",
    "Content": "Status: Complete. Given by Brewmaster Brack in Session 11. The goal was to deliver a barrel of brew to a Wildrunner outpost without shaking it and to ignore it if it sang. The party successfully delivered the barrel. Notable reward: 100 gp and a Bag of Holding.",
    "Related": ["CHAR-003", "CHAR-020", "CHAR-025"]
  },
  {
    "ID": "QUEST-006",
    "Type": "Quest",
    "Name": "Stop the Emberfang Kobolds",
    "Content": "Status: Complete. Given by Elder Branver Emberbrush in Session 14/15. The goal was to stop the Emberfang kobold raids on the Wildrunners and rescue poached Bee Rexes. The party cleared three outposts and the main camp, 'The Nest,' defeating their leaders and a half-red dragon Indominus Rex. Notable casualties: Numerous kobolds, a Red Slaad Broodmaster, Tunnel Howlers, and the half-red dragon Indominus Rex. Notable reward: Personal rewards for each party member and a strengthened alliance with the Wildrunners.",
    "Related": ["CHAR-025", "CHAR-026", "EVENT-012", "EVENT-014", "EVENT-015"]
  },
  {
    "ID": "QUEST-007",
    "Type": "Quest",
    "Name": "Investigate the Mysterious Stone",
    "Content": "Status: Complete. Taken from a job board in Session 5, investigated in Session 7 in Emberfell. The goal was to investigate a glowing, whispering stone dug up on Maeven's farm. The party discovered it was a piece of Nyx at a corrupted celestial binding point, and they rolled it away from the town to disperse its negative effects. Notable reward: 100 gp from Maeven Thornholt.",
    "Related": ["LOC-007", "LOC-008", "EVENT-007"]
  },
  {
    "ID": "QUEST-008",
    "Type": "Quest",
    "Name": "Find the Missing Gatherers (Thick Wildflower Fields)",
    "Content": "Status: Complete. Taken from a job board in Session 5, investigated in Session 8 in Petalmere. The goal was to find Tamson, who went missing in the fey-touched wildflower fields. The party discovered she was taken by the Ash Thorn Court as part of an ancient bargain and chose to stay. They retrieved a scroll proving the bargain. Notable reward: 200 gp each from Elder Myla and free lodging in Petalmere.",
    "Related": ["CHAR-014", "CHAR-015", "CHAR-024", "LOC-006", "EVENT-008"]
  },
  {
    "ID": "QUEST-009",
    "Type": "Quest",
    "Name": "Investigate Colm's Bounty Origin", 
    "Content": "Status: In Progress. Initiated in Session 27 upon arrival at Stonehaven Shores. The goal is to understand why Colm's bounty poster was issued from this distant goliath retirement community and uncover connections to the tournament poisoning. Progress: Records examined revealing Tyber is alive, Colm's blade residue matched royal stores, and records were amended under royal order. Next steps: Investigate local events for connections, particularly the uncovered crypt.",
    "Related": ["CHAR-004", "CHAR-030", "CHAR-032", "LOC-013", "EVENT-017"]
  },
  {
    "ID": "QUEST-010", 
    "Type": "Quest",
    "Name": "Brynd's Soul Inquiry",
    "Content": "Status: Active. Brynd's personal quest declared in Session 27 after philosophical discussion about snakes and souls. The goal is to find a necromancer who can answer what threshold of intelligence is required to possess a soul, specifically wondering how stupid one must be to lack a soul.",
    "Related": ["CHAR-002", "EVENT-017"]
  },
  {
    "ID": "QUEST-011",
    "Type": "Quest", 
    "Name": "Investigate the Uncovered Crypt",
    "Content": "Status: Not Started. One of the local events mentioned by Elder Marrin in Session 27. A crypt was uncovered by violent tides, someone poked at it but didn't properly explore it. The party decided this would be their first investigation in Stonehaven Shores.",
    "Related": ["LOC-013", "EVENT-017"]
  }
]
